Repository: wildtruc/zenvidia
Catalog: locale/locale_dev/*.po
Languages: fr_fr

source: $(cat <<-RPT ${r}<b><big>Unexpected ERROR.</big></b>${end} ${j}<b>$inst_mod_version isn't $(new_version)</b>${end}. Really weird. ${jB}O_o${end} ! Some unknown bug pops up during driver installation. Or developper fucked out something ? Can't tell. RPT )
fr_fr: $(cat <<-RPT ${r}<b><big>ERREUR inattendue.</big></b>${end} ${j}<b>La version $inst_mod_version n'est pas $(new_version)</b>${end}. Très étrange. ${jB}O_o${end} ! Pour une raison inconnue un bogue est apparue durant l'installation. Ou le développer a foiré quelque chose On ne saurait dire. RPT )

source: ${j}<big>$(new_version) installed ended</big>${end}
fr_fr: ${j}<big>L'installation de $(new_version) est terminée</big>${end}

source: $(cat <<-RPT ${y}<b><big>Driver installation complete</big></b>${end} Because <b>Nouveau driver</b> is still loaded you need to reboot the system for change to take effects. RPT )
fr_fr: $(cat <<-RPT ${y}<b><big>Installation du pilote completée</big></b>${end} Le <b>pilote Nouveau</b> est encore actif. Vous devez redémarrer le système pour appliquer les changements. RPT )

source: $(cat <<-RPT ${rB}${bf}Ouch!${end}${end} ${jB}No proper Nvidia package found.${end} RPT )
fr_fr: $(cat <<-RPT ${rB}${bf}Ouille!${end}${end} ${jB}Pas de paquet applicable trouvé.${end} RPT )

source: $(cat <<-TXT <!DOCTYPE html> <html> <head> <style> html { border: 3px solid #F53000; border-radius: 5px; } body { background:#3F3E3E; color: ${main}; height=120px; } a { color: ${log_msg}; text-decoration: none; } a:hover { font-weight:bold;} </style> </head> <body> You need to download the right package manually for your ${dev_name}.<br> Got to the Nvidia <a href="http://www.nvidia.fr/Download/Find.aspx?lang=en">download center</a> site, or directly to the NVIDIA ftp repository <a href="https://download.nvidia.com/XFree86/">here</a>.<br> </body> </html> TXT )
fr_fr: $(cat <<-TXT <!DOCTYPE html> <html> <head> <style> html { border: 3px solid #F53000; border-radius: 5px; } body { background:#3F3E3E; color: ${main}; height=120px; } a { color: ${log_msg}; text-decoration: none; } a:hover { font-weight:bold;} </style> </head> <body> Vous devez télécharger le bon paquet manuellement pour votre ${dev_name}.<br> Allez sur le <a href="http://www.nvidia.fr/Download/Find.aspx?lang=en">site de téléchargements</a> de Nvidia, ou directement sur le répertoire FTP, <a href="https://download.nvidia.com/XFree86/">ici</a>.<br> </body> </html> TXT )

source: # ${v}${j}($n%)${end} - $(new_version) package already extracted${end}
fr_fr: # ${v}${j}($n%)${end} - Le paquet $(new_version) eest déjà extrait${end}

source: # ${v}${j}($n%)${end} - Primary package extraction${end}
fr_fr: # ${v}${j}($n%)${end} - Extraction primaire du paquet${end}

source: # ${j}($m%)${end}${ge}${sf} * ($m%) Extracting $extracted_release${end}${end}
fr_fr: # ${j}($m%)${end}${ge}${sf} * ($m%) Extraction de $extracted_release${end}${end}

source: ${j}${bf}Nvidia repository not found${end}${end}.${v} Extraction failure.${end}
fr_fr: ${j}${bf}Le répertoire Nvidia n'a pas été trouvé${end}${end}.${v} Échec de l'extraction.${end}

source: # ($m s) - Backup : $bak_version tar ball creation
fr_fr: # ($m s) - Sauvegarde : Création du tarball $bak_versiona

source: # ($m s) - Backup : $bak_version $ZIP archive creation
fr_fr: # ($m s) - Sauvegarde : Création de l'archive $bak_version $ZIP

source: # Backup: $bak_version $ZIP archive created
fr_fr: # Sauvegarde: Archive $bak_version $ZIP créée

source: $(cat <<-MSG $menu_msg Driver install ${j}$up_version${end} for hardware ${j}${dev_name}${end}. Select the kernel to update. MSG )
fr_fr: $(cat <<-MSG $menu_msg Installation du pilote ${j}$up_version${end} pour le matériel ${j}${dev_name}${end}. Sélection du noyau à mettre à jour MSG )

source: ${j}<b>Kernel driver update</b>${end}\n${y}$KERNEL${end} drivers will be update.
fr_fr: ${j}<b>Mise à jour du pilote par noyau</b>${end}\n Le pilote ${y}$KERNEL${end} sera mis à jour.

source: Update
fr_fr: Mise à jour

source: ${v}Kernel ${j}$KERNEL${end} driver update${end}
fr_fr: ${v}Mise à jour du pilote du noyau ${j}$KERNEL${end}${end}

source: # Kernel update $KERNEL ...
fr_fr: # Mise à jour du noyau $KERNEL ...

source: ${j}INSTALL ABORT ABNORMALY, check $(echo "$logfile" | sed -n 's/^.*=//p')${end}.
fr_fr: ${j}L'INSTALLATION A ÉCHOUÉE ANORMALEMENT, vérifiez $(echo "$logfile" | sed -n 's/^.*=//p')${end}.

source: $(cat <<-HLP ${v}<b>Select the driver version type to install</b>${end} ${sf} - <b>Look up for latest</b>: Look for the last available packges from Nvidia repos site. - <b>Look up for older version</b>: Look for a previous packages available in Nvidia repos site. ${end} HLP )
fr_fr: $(cat <<-HLP ${v}<b>Sélection du type de pilote à installer</b>${end} ${sf} - <b>Rechercher la dernière version</b>: Trouver le dernier paquet disponible sur site Nvidia. - <b>Rechercher une ancienne version</b>: Trouver un paquet plus ancien disponible sur site Nvidia. ${end} HLP )

source: \n${v}<b>Select the driver version type to install</b>${end}
fr_fr: \n${v}<b>Sélectionner le type de pilote à installer</b>${end}

source: Look for latest veersion
fr_fr: Rechercher la dernière version

source: Look for older version
fr_fr: Rechercher une ancienne version

source: ${j}${bf}Driver version type to install${end}\n${end}${v}$hlp_tip${end}
fr_fr: ${j}${bf}Type de pilote à installer${end}\n${end}${v}$hlp_tip${end}

source: NVIDIA Download center data check
fr_fr: Contrôle des données sur le site de téléchargement

source: NVIDIA Download center compatibility check (${j}$DRV${end})...
fr_fr: Contrôle des compatibilités (${j}$DRV${end}) depuis le site NVIDIA...

source: install_msg='# ${v}${j}($n%)${end} - Compatiblity found in ${y}$(echo "$DRV" | cut -d. -f1)${end} serie, proceed to install${end}'
fr_fr: install_msg='# ${v}${j}($n%)${end} - Compatibilité trouvée dans la série ${y}$(echo "$DRV" | cut -d. -f1)${end}, démarrage installation${end}'

source: $(cat <<-ERR ${rB}${bf}<i>UNCOMPATIBLE DRIVER</i>${end}${end} ${v}The ${j}$pci_class${end} is not compatible with ${j}$DRV${end} driver. Check in ${j}$comp_file${end} serie or greater instead. Abort.${end} ERR )
fr_fr: $(cat <<-ERR ${rB}${bf}<i>PILOTE INCOMPATIBLE</i>${end}${end} ${v}Le ${j}$pci_class${end} n'est pas compatible avec le pilote ${j}$DRV${end}. Vérifier la série ${j}$comp_file${end} ou plus à la place. Abandon.${end} ERR )

source: $(cat <<-ERR ${rB}${bf}<i>UNCOMPATIBILITY ISSUE</i>${end}${end} ${v}The ${j}$pci_class${end} is not supported by ${j}NIVDIA${end} driver and there's no solution here except reverse to ${j}Nouveau${end} driver. Abort.${end} ERR )
fr_fr: $(cat <<-ERR ${rB}${bf}<i>PROBLÈME D'INCOMPATIBILITÉ</i>${end}${end} ${v}Le ${j}$pci_class${end} n'est pas supporté par le pilote ${j}NIVDIA${end}. Il n'y pas de solution à part revenir au pilote ${j}Nouveau${end}. Abandon.${end} ERR )

source: (installed)
fr_fr: (installé)

source: (VDPAU class $_vclass)
fr_fr: (classe VDPAU $_vclass)

source: \n${y}but is not downloadable yet (wont be list)${end}
fr_fr: \n${y}mais n'est pas encore téléchargeable (ne sera pas listé)${end}

source: ${vB}uncompatible${end}
fr_fr: ${vB}incompatible${end}

source: ${y}$_drive${end} ${rB} driver doesn't manage your hardware${end}\n
fr_fr: ${rB}Le pilote ${y}$_drive${end} ${rB} ne supporte pas votre matériel${end}\n

source: ${j}$_drive${end} ${v} driver fit your hardware${end} ${y}$(echo -e '\u2764')${end}\n
fr_fr: ${v}Le pilote ${j}$_drive${end} convient à votre matériel${end} ${y}$(echo -e '\u2764')${end}\n

source: official
fr_fr: officiel

source: beta
fr_fr: bêta

source: last release
fr_fr: dernière version

source: legacy
fr_fr: hérité

source: is not in your repository
fr_fr: n'est pas dans votre dépôt

source: is in your repository
fr_fr: est dans votre dépôt

source: \n${v}The $set_beta version is :${end}${ge} ${tab} - - - - - - ${end}${y}$_drive${end}
fr_fr: \n${v}La version $set_beta est :${end}${ge}${tab} - - - - - - ${end}${y}$_drive${end}

source: Nothing to do.
fr_fr: Rien à faire.

source: ${y}this driver is not supported anymore${end}
fr_fr: ${y}ce pilote n'est plus supporté${end}

source: (last legacy)
fr_fr: (dernier hérité)

source: \n${v}Last ${y}$family_last${end} will be list.${end}
fr_fr: \n${v}Le dernier ${y}$family_last${end} sera listé.${end}

source: \n${v}Devices compatibility found in ${y}$family${end} serie${end}$comp_d
fr_fr: \n${v}compatibilité matérielle trouvé dans la série ${y}$family${end}{end}$comp_d

source: \n${v}Compatible driver for ${y}$family${end} serie already installed.${end}
fr_fr: \n${v}Pilote compatible pour la série ${y}$family${end} déjà installé.${end}

source: $(cat <<-MSG ${jB}${bf}Available drivers${end}${end} ${v}Driver version installed :${end}${ge} - - - - - ${end}${j}$(drv_installed)${end} $(cat <<< ${main_msg[@]}) $compat_msg $extra_msg MSG )
fr_fr: $(cat <<-MSG ${jB}${bf}Pilotes disponibles drivers${end}${end} ${v}Version de Pilote installé :${end}${ge} - - - - - ${end}${j}$(drv_installed)${end} $(cat <<< ${main_msg[@]}) $compat_msg $extra_msg MSG )

source: Install
fr_fr: Installer

source: Download
fr_fr: Télécharger

source: $(cat <<-INFO ${j}${bf}Install from stock${end}${end} Driver list in $nvdl $loaded INFO )
fr_fr: $(cat <<-INFO ${j}${bf}Installer depuis le dépôt local${end}${end} Liste des pilotes dans $nvdl $loaded INFO )

source: $(cat <<-INFO ${j}${bf}Install from user directory${end}${end} Select a driver from ${j}$(def_user)${end} download directory $loaded INFO )
fr_fr: $(cat <<-INFO ${j}${bf}Installer depuis un répertoire local${end}${end} Sélectionner un pilote depuis répertoire de téléchargement de ${j}$(def_user)${end} $loaded INFO )

source: ${v}<i>${y}$(version)${end} actually installed and loaded.</i>${end}
fr_fr: ${v}<i>${y}$(version)${end} actuellement installée et active.</i>${end}

source: Use Zenvidia stock directory
fr_fr: Utiliser le dépôt Zenvidia

source: Use a user local directory
fr_fr: Utiliser un répertoire utilisateur local

source: $(cat <<-INFO ${j}<b>Local NVIDIA drivers STOCK</b>${end} Zenvidia release stock : ${j}<b>${#nvdl_list[*]}</b>${end} object(s) found. User home directory : ${j}<b>${#home_list[*]}</b>${end} object(s) found. ${v}<b>Select the directory to install from.</b>${end} INFO )
fr_fr: $(cat <<-INFO ${j}<b>Dépôt local des pilotes NVIDIA</b>${end} Dépôt Zenvidia : ${j}<b>${#nvdl_list[*]}</b>${end} object(s) trouvé(s). Dossier utilisateur : ${j}<b>${#home_list[*]}</b>${end} object(s) trouvé(s). ${v}<b>Sélectionner le dossier source.</b>${end} INFO )

source: ${v}Driver download ${j}$LAST_PACK${end} ended.${end}
fr_fr: ${v}Le téléchargement de ${j}$LAST_PACK${end} est achevé.${end}

source: $(cat <<-INFO ${jB}${bf}Downloads${end}${end} Select the drivers version you wish to $ok_label. in the list below INFO )
fr_fr: $(cat <<-INFO ${jB}${bf}Téléchargement${end}${end} Sélectionner la version du pilote à gérer. dans la liste ci-dessous INFO )

source: $(cat <<-MSG ${jB}${bf}Downloads${end}${end} NVIDIA ${y}$dl_cmd${end} driver is going to be $ok_label. ${v}Are you sure ?${end} MSG )
fr_fr: $(cat <<-MSG ${jB}${bf}Téléchargement${end}${end} Le pilote NVIDIA ${y}$dl_cmd${end} va être $ok_label. ${v}Confirmez${end} MSG )

source: download
fr_fr: téléchargé

source: install
fr_fr: installé

source: ${r}Driver download failure${end}\nOutput is empty.
fr_fr: ${r}Échec du téléchargement${end}\nLa sortie vide.

source: ${v}Driver download ${j}$LAST_PACK${end} failure.\n The package ${j}$run_pack${end} doesn't exist.${end}
fr_fr: ${v}Échec du téléchargement de ${j}$LAST_PACK${end}.\n Le paquet ${j}$run_pack${end} n'existe pas.${end}

source: ${v}Remote content control...${end}
fr_fr: ${v}Contrôle du contenu distant...${end}

source: ${v}Choose the version to install${end}
fr_fr: ${v}Choisissez la version à installer${end}

source: <b>Downlaoding ${j}$LAST_PACK${end} driver from ${y}$nvidia_ftp${end}</b>
fr_fr: <b>Téléchargement du pilote ${j}$LAST_PACK${end} depuis ${y}$nvidia_ftp${end}</b>

source: ${j}<b>Download check sum error</b>${end}.\nTransaction aborted\nTry to restart driver download from <b>Update menu</b>
fr_fr: ${j}<b>Erreur de téléchargement de la somme de contrôle</b>${end}.\nÉchec de la transaction\nEssayez de la relancer depuis le menu <b>Mettre à jour</b>

source: ${j}<b>Download unexpected end</b>${end}.\nPlease restart driver download from <b>Update menu</b>
fr_fr: ${j}<b>Fin prématuré du téléchargement</b>${end}.\nSVP, redémarrer le téléchargement depuis le menu <b>Mettre à jour</b>

source: $(cat <<-WRN ${r}<b>Remote directory is empty.</b>${end} Nvidia devs have probably forgoten to upload data. Feel free to try at a later time. WRN )
fr_fr: $(cat <<-WRN ${r}<b>Le répertoire distant est vide.</b>${end} Nvidia a peut être oublié de téléverser les données. Réessayer un peu plus tard. WRN )

source: # ${nr}***** Close window to escape *****${end}
fr_fr: # ${nr}***** Fermer la fenêtre pour sortir *****${end}

source: # ${nr}***** Window will auto-close in ${xt_delay} seconds *****${end}
fr_fr: # ${nr}***** La fenetre fermera dans ${xt_delay} secondes *****${end}

source: ${y}<b>Open Source driver</b>${end} will apply.
fr_fr: Le pilote ${y}<b>Open source</b>${end} sera appliqué.

source: ${y}<b>Closed Source driver</b>${end} will apply.
fr_fr: Le pilote ${y}<b>propriétaire</b>${end} seraz appliqué.

source: ${j}<b>Open Source Driver</b>${end} will be removed.
fr_fr: Le pilote ${j}<b>Open Source</b>${end} sera retiré.

source: $(cat <<-SPW ${j}${bf}Task bar Driver switch${end}${end} <b>Nvidia Open driver configuration sets has been change</b>. $drv_swt_message ${sf}<i>(driver license $(modinfo -F license nvidia -k $KERNEL) actualy loaded)</i>${end} Press button to apply. Confirmation window will be displayed. SPW )
fr_fr: $(cat <<-SPW ${j}${bf}Permutation depuis la barre des tâches${end}${end} <b>La configuration des pilotes ouvert a été changé</b>. $drv_swt_message ${sf}<i>(Licence du pilote $(modinfo -F license nvidia -k $KERNEL) actuellement active)</i>${end} Presser le bouton pour appliquer. Une fenêtre de confirmation sera afichée. SPW )

source: $(cat <<-MSG ${v}${j}${bf}Driver switch${end}${end} <b>Driver type selection (open source / proprietary)</b>. <i>( ${y}driver with license $(modinfo -F license nvidia -k $KERNEL) actualy loaded${end} )</i>${end} MSG )
fr_fr: $(cat <<-MSG ${v}${j}${bf}Permutation de pilote${end}${end} <b>Sélection du type de pilote (open source / propriétaire)</b>. <i>( ${y}Pilote avec la licence $(modinfo -F license nvidia -k $KERNEL) actuellement actif${end} )</i>${end} MSG )

source: Load proprietary drivers
fr_fr: Activation du pilote propriétaire

source: Load Open Source Drivers
fr_fr: Activation du pilote Open Source

source: $(cat <<-MSG ${v}<u>Note</u>${end} : <i>In case of issue after restauration (ex: driver not loading), try command line tools in first place after reboot. Many distro auto reload desktop manager at boot in case of failure. If you meet this issue, you have to disable the desktop manager with systemcl before operating with "zenvidia rebuild [version]" command line</i>. MSG )
fr_fr: $(cat <<-MSG ${v}<u>Note</u>${end} : <i>En cas soucis après la restauration (ex: le pilote ne se charge pas), essayez en premier lieu la ligne de commande après redémarrage. Beaucoup de distribution recharge automatiquement le gestionnaire de session en cas d'échec. Si vous rencontrez ce problème, désactivez-le avec systemcl avant d'opérer avec la ligne de commande "zenvidia rebuild [version]"</i>. MSG )

source: $(cat <<-HLP ${sf} - <b>Remove downloaded packages</b>: Manage downloaded packages in Zenvidia directory. - <b>Backup tools</b>: Make a drivers and libraries backup of the current version. - <b>Restore tool</b>: Make a restoration of previously backed up drivers installation. - <b>Remove Nvidia and restore to default</b>: Remove completly Nvidia Drivers installation and restore default Nouveau drivers. ${end} HLP )
fr_fr: $(cat <<-HLP ${sf} - <b>Supprimer des paquets téléchargés</b>: Gérer les paquets téléchargés dans le dossier Zenvidia. - <b>Outils de sauvegarde</b>: Faire une sauvegarde du pilote actuel et de ses librairies. - <b>Outils de restauration</b>: - <b>Supprimer Nvidia et restaurer le système par défaut</b>: Supprimer complètement l'installation du pilote Nvidia et revenir aux pilotes Nouveau. ${end} HLP )

source: ${j}${bf}Manage drivers packages${end}${end}$w_text$hlp_tip
fr_fr: ${j}${bf}Gérer les paquets pilote${end}${end}$w_text$hlp_tip

source: Remove downloaded package
fr_fr: Supprimer des paquets téléchargés

source: Backup tools
fr_fr: Outils de sauvegarde

source: Restore a backup
fr_fr: Outils de restauration

source: Remove Nvidia and restore to default
fr_fr: Supprimer Nvidia et restaurer le système par défaut

source: $(cat <<-MSG ${j}<b>Remove downloaded package</b>${end} Select one or more packages to be removed. MSG )
fr_fr: $(cat <<-MSG ${j}<b>Supprimer des paquets téléchargés</b>${end} Sélectionner un paquet ou plus à supprimer. MSG )

source: $(cat <<-MSG Selected to be removed: ${j}${rm_packs[*]}${end} driver(s). Please, confirm. MSG )
fr_fr: $(cat <<-MSG sélectionné pour la suppression: Pilote(s) ${j}${rm_packs[*]}${end}. SVP, confirmer. MSG )

source: $(cat <<-INFO ${j}<b>$pack_version still exist in DKMS tree</b>.${end} Remove all associated package and directory ? <i>(All reference in $nv_root will be also removed if found)</i> Please, confirm. INFO )
fr_fr: $(cat <<-INFO ${j}<b>$pack_version encore précédente dans DKMS </b>.${end} Supprimer tous les paquets et dossiers associés ? <i>(Toutes références dans $nv_root sera aussi retiré (si trouvé)</i> SVP, confirmer. INFO )

source: $(cat <<-WRN <b>WARNING</b> The associated directory you're about to remove is the same as the actually running. This action will fataly break ${j}$pack_version${end} installation You don't want to do this. Action skipped. WRN )
fr_fr: $(cat <<-WRN <b>ATTENTION</b> Le dossier associé que vous allez supprimer est le même que celui en activité. Ceci cassera nécessairement de l'installation de ${j}$pack_version${end} Vous ne voulez pas faire ça. Action passée. WRN )

source: I understand my mistake
fr_fr: Je comprends mon erreur

source: $(cat <<-MSG ${v}<b>Driver(s)</b>:${end} ${j}${rm_packs[*]}${end} package(s) removed. MSG )
fr_fr: $(cat <<-MSG ${v}<b>Pilote(s)</b>:${end} Le(s) paquet(s) ${j}${rm_packs[*]}${end} supprimé(s). MSG )

source: $(cat <<-MSG ${j}<b>Remove backed up package</b>${end} Select one or more archives to be removed. MSG )
fr_fr: $(cat <<-MSG ${j}<b>Supprimer des paquets sauvegardés</b>${end} Sélectionner une archive ou plus à supprimer. MSG )

source: $(cat <<-MSG Selected driver(s) to be removed: ${j}${rm_bak[*]}${end} Please, confirm. MSG )
fr_fr: $(cat <<-MSG Pilote(s) sélectionné(s) à supprimer: ${j}${rm_bak[*]}${end} SVP, confirmer. MSG )

source: ${vB}Driver(s) Archive(s) removed.${end}
fr_fr: ${vB}Archive(s) pilote(s) supprimée(s).${end}

source: $(cat <<-MSG ${j}<b>NVIDIA driver installation will be completaly removed.</b>${end} Only Nouveau driver will usable after reboot. ${y}Please, confirm.${end} MSG )
fr_fr: $(cat <<-MSG ${j}<b>L'installation du pilote NVIDIA sera complètement supprimé.</b>${end} Uniquement le pilote Nouveau sera utilisable après le redémarrage. ${y}SVP, confirmer.${end} MSG )

source: ${y}<b>Nvidia drivers complete removal</b>${end}
fr_fr: ${y}<b>Suppression complète du pilote Nvidia</b>${end}

source: # Making security $(version) backup.
fr_fr: # Fait une sauvegarde de sécurité de $(version)

source: Backup : ${j}$bak_version${end} backup archive creation
fr_fr: Sauvegarde : création de l'archive de sauvegarde ${j}$bak_version${end}

source: # Nvidia Installation removal ...
fr_fr: # Suppression de l'installation Nvidia ...

source: # Libraries registry update.
fr_fr: # Mise à jour du registre des librairies.

source: # Grub update.
fr_fr: # Mise à jour de Grub.

source: # Perform modules dependencies and initramfs update.
fr_fr: # Mise à jour des dépendances des modules et de l'initramfs.

source: # Depmod $KERNEL modules ($m sec.)
fr_fr: # Depmod des modules $KERNEL ($m sec.)

source: # Exec $KERNEL modules init/reload ($m sec.)
fr_fr: # Exécution de rechargement/init des modules $KERNEL ($m sec.)

source: $(cat <<-MSG ${j}<b>NVIDIA driver installation is now completaly removed</b>${end}. Restart the computer for change to take effect. MSG )
fr_fr: $(cat <<-MSG ${j}<b>L'installation du pilote NVIDIA est maintenant supprimée</b>${end}. Redémarrer l'ordinateur pour que les changements prennent effets. MSG )

source: $(cat <<-MSG ${v}Select the driver tool to use.${end} MSG )
fr_fr: $(cat <<-MSG ${v}Sélectionner l'outil pilote à utiliser.${end} MSG )

source: $(cat <<-INFO ${sf} <b>Make a backup</b> : - Back up the current isntalled driver installation. <b>Remove a backup</b> : - Remove archived installation driver packages. ${end} INFO )
fr_fr: $(cat <<-INFO ${sf} <b>Faire une sauvegarde</b> : - Sauvegarder l'installation pilote courante. <b>Supprimer une sauvegarde</b> : - Supprimer un paquet d'archive d'installation. ${end} INFO )

source: ${j}${bf}Backup manager${end}${end}$hlp_tip$w_text
fr_fr: ${j}${bf}Gestionnaire de sauvegardes${end}${end}$hlp_tip$w_text

source: Make a backup
fr_fr: Faire une sauvegarde

source: Remove a backup
fr_fr: Supprimer une sauvegarde

source: $(cat <<-MSG ${j}$bak_version${end} is already backed up. No reason to do it again. Do you want to overwrite ? MSG )
fr_fr: $(cat <<-MSG ${j}$bak_version${end} est déjà sauvegardé. Aucune raison de le refaire. Voulez-vous l'écraser ? MSG )

source: $(cat <<-WRN You are going to backup ${j}$bak_version${end} driver installation Please, confirm. WRN )
fr_fr: $(cat <<-WRN Vous allez sauvegarder l'installation du pilote ${j}$bak_version${end} SVP, confirmer. WRN )

source: $(cat <<-WRN ${jB}Driver install overwrite${end} ${v}The backup you are going to restore is the same as the one used by the system. In previous driver version before <b>libglxserver_nvidia.so</b> usage, overwrite libGL.so crash the X server. To prevent data loss when restoring and others ugly deasagrements, Zenvidia wont replace the actual install by overwriting ${j}$res_version${end} over itself. If you really wish to overwrite, use the command line tool with desktop manager service disabled, closed the actual desktop session and press ctrl+alt+F[1-4]. And type : <i>zenvidia restore [version]</i> (help will display) (<i>Desktop Manager, ex: systemctl disable $(dm_serv).service</i>)${end} WRN )
fr_fr: $(cat <<-WRN ${jB}Écrasement de l'installation du pilote ${v}La sauvegarde que vous allez restaurer est la même qu'utilisée par le système. Dans les anciennes versions avant l'usage de <b>libglxserver_nvidia.so</b>, écraser libGL.so crache le serveur X. Pour prémunir des pertes de données à la restauration et autres désagréments, Zenvidia ne remplacera pas l'installation actuelle par écrasement de ${j}$res_version${end} sur lui-même. Si vous désirez écraser quand même, utilisez la ligne de commande avec le service de gestionnaire de bureau désactivé, fermez la session, puis presser ctrl+alt+F[1-4]. Enfin tapez : <i>zenvidia restaure [version]</i> (une aide s'affichera) (<i>Gestionnaire de bureau, ex: systemctl disable $(dm_serv).service</i>)${end} WRN )

source: $(cat <<-MSG ${j}<b>restauration tool</b>${end} Driver actually loaded $(drv_installed). ${v}Select the driver you want to restore.${end} MSG )
fr_fr: $(cat <<-MSG ${j}<b>Outil de restauration</b>${end} Pilote actuellement actif $(drv_installed). ${v}Sélectionner le pilote que vous désirez restaurer.${end} MSG )

source: ${v}Restoring ${j}$res_version${end} will replace actual${end} ${j}$(version)${end}.
fr_fr: ${v}La restauration de ${j}$res_version${end} remplacera l'actuel${end} ${j}$(version)${end}.
