Repository: wildtruc/zenvidia
Catalog: locale/locale_dev/*.po
Languages: fr_fr

source: # ${j}($n%)${end}${ge}${sf} * Blacklist and GRUB conf update if needed${end}${end}
fr_fr: # ${j}($n%)${end}${ge}${sf} * Mise à jour de la configuration GRUB et Blacklist si besoin${end}${end}

source: # ${v}${j}($n%)${end} - Cleaning old $(old_lib_version) source and DKMS tree if needed.${end}
fr_fr: # ${v}${j}($n%)${end} - Nettoyage des anciennes arborescences $(old_version) source et DKMS.${end}

source: \t\t\t\t${gB} old version\t${end}> ${y}${old_lib_version} directory cleaned${end}.\n
fr_fr: \t\t\t\t${gB} ancienne version\t${end}> ${y}répertoire ${old_lib_version} nettoyée${end}.\n

source: \t\t\t\t${gB} old source\t${end}> ${y}All ${old_lib_version} version cleaned${end}.\n
fr_fr: \t\t\t\t${gB} ancienne source\t${end}> ${y}répertoire ${old_lib_version} nettoyé${end}.\n

source: # ${v}${j}($n%)${end} - Create DKMS conf file...${end}
fr_fr: # ${v}${j}($n%)${end} - Création du fichier de configuration DKMS...${end}

source: # Create DKMS conf file...
fr_fr: # Création du fichier de configuration DKMS...

source: # ${v}${j}($n%)${end} - DKMS MOK key/certificate are missing, generating new one for modules signin process.${end}
fr_fr: # ${v}${j}($n%)${end} - La clé/certificat DKMS MOK est manquant, création d'un nouveau pour la signature des modules.${end}

source: # ${r}${j}($n%)${end} - MOK $mok_signing_key key not found and/or can't be generated, modules won't be signed${end}
fr_fr: # ${r}${j}($n%)${end} - clé MOK $mok_signing_key non trouvée ou/et non généré, les modules ne seront pas signés${end}

source: $(cat <<-ERROR ${r}MODULES SIGNATURE ERROR${end}. $(new_version) compilation can't be done successfully. $mok_signing_key and $mok_certificate can't be found and attempt to create new ones failed. Very sorry about that. ERROR )
fr_fr: $(cat <<-ERROR ${r}ERREUR DE SIGNATURE DES MODULES${end}. Le succès de la compilation de $(new_version) est compromis. $mok_signing_key et $mok_certificate n'ont pas été trouvés' et la tentative de création a échoué. Désolée. ERROR )

source: #${j} ${r}ERROR${end} : No $_dkms ${j}$(new_version)${end} modules found in kernel path $kernel_path.${end}
fr_fr: #${j} ${r}ERREUR${end} : Pas de modules $_dkms ${j}$(new_version)${end} trouvés dans $kernel_path.${end}

source: #${v} Workaround : Copying ${y}$_dkms${end} modules in $kernel_path from DKMS repository.${end}
fr_fr: #${v} Contournement : Copie des modules ${y}$_dkms${end} dans $kernel_path depuis le répertoire DKMS.${end}

source: # ${ge}* Compressing $_dkms modules if needed.
fr_fr: # ${ge}* Compression des modules $_dkms si besoin.

source: * Exec $KERNEL modules depmod ($m sec.)
fr_fr: * Exécution de depmod pour les modules $KERNEL ($m sec.)

source: # ${ge}${sf}Depmod $KERNEL modules ($m sec.)${end}${end}
fr_fr: # ${ge}${sf}Exécution de depmod pour les modules $KERNEL ($m sec.)${end}${end}

source: # ${y}* All Clear modules loaded ($(new_version) modules moved from dkms dir)${end}.
fr_fr: # ${y}* Tout est en ordre, les modules sont chargés (($(new_version) copiés depuis le répertoire dkms)${end}.

source: # ${j}* --- ${r}ERROR${end} --- Driver not found in path --- ${end}
fr_fr: # ${j}* --- ${r}ERREUR${end} --- Aucun pilote trouvés dans le chemin d'accès --- ${end}

source: # ${j}* You can try ${y}Update drivers or modules</b> -> </b>Update driver only (dkms/force)${end} as workaround install${end}
fr_fr: # ${j}* Essayez ${y}Mettre à jour les pilotes et modules</b> -> </b>Mettre à jour le pilote uniquement (dkms/forcé)${end} comme voie de contournement${end}

source: - ${r} (ERROR $_dkms, safe modules not copied)${end}
fr_fr: - ${r} (ERREUR $_dkms, modules fiables non copiés)${end}

source: #${v} * --- ${r}ERROR${end} --- Driver not found in path ---- ${end}
fr_fr: #${v} * --- ${r}ERREUR${end} --- Aucun pilote trouvés dans le chemin d'accès ---- ${end}

source: - ${r}(ERROR $_dkms, no safe modules found)${end}
fr_fr: - ${r}(ERREUR $_dkms, pas de modules fiables trouvés)${end}

source: # ${y}* Checking $(new_version) in DKMS $KERNEL path${end}
fr_fr: # ${y}* Vérification des modules $(new_version) pour le chemin $KERNEL$ de DKMS{end}

source: # ${y}* Checking $(new_version) in DKMS $KERNEL build path${end}
fr_fr: # ${y}* Vérification des modules $(new_version) pour le chemin de compilation $KERNEL de DKMS${end}

source: # ${j}* --- ${r}ERROR${end} --- No $_dkms modules found in DKMS build path${end}
fr_fr: # ${j}* --- ${r}ERREUR${end} --- Pas de modules $_dkms trouvés dans le dossier de compilation DKMS${end}

source: # ${v}* You can try ${y}Update Driver${end} menu > ${y}Update from source${end} as workaround install${end}
fr_fr: # ${v}* Essayez ${y}Mettre à jour les pilotes et modules</b> -> </b>Mettre à jour le pilote uniquement (forcé)${end} comme voie de contournement${end}

source: - ${r}(ERROR $_dkms, no modules found)${end}
fr_fr: - ${r}(ERREUR $_dkms, pas de modules trouvés)${end}

source: #${v} Removing previous ${j}$(old_version)${end} ${y}$_dkms${end} DKMS modules from DKMS tree.${end}
fr_fr: #${v} Supprime le modules ${j}$(old_version)${end} ${y}$_dkms${end} DKMS précédent de l’arborescence.${end}

source: #${v} Add ${j}$(new_version)${end} ${y}$_dkms${end} modules to DKMS tree.${end}
fr_fr: #${v} Ajoute les modules ${j}$(new_version)${end} ${y}$_dkms${end} à l'arborescence DKMS.${end}

source: #${ge}* Removing out of DKMS tree $mod_installed $_dkms from kernel modules path.${end}
fr_fr: #${ge}* Supprime les modules $mod_installed hors arborescence DKMS du chemin d'accès noyau.${end}

source: # ${ge}* Executing clean depmod before next step.${end}
fr_fr: # ${ge}* Exécute un depmod propre avant la prochaine étape.${end}

source: # ${ge}* Done.${end}
fr_fr: # ${ge}* Fait.${end}

source: # ${ge}* No previous driver found. Installing $(new_version) $_dkms.${end}
fr_fr: # ${ge}* Pas de pilote antérieur trouvé. Installation de $(new_version) $_dkms.${end}

source: #${v} Building ${j}$(new_version)${end} ${y}$_dkms${end} DKMS modules for $KERNEL${end}
fr_fr: #${v} Compilation des modules DKMS ${j}$(new_version)${end} ${y}$_dkms${end} pour $KERNEL${end}

source: # ${y}* All Clear for $(new_version) $_dkms already build.${end}
fr_fr: # ${y}* Tout est en ordre pour $(new_version) $_dkms, déjà construit.${end}

source: # ${y}* All Clear for $(new_version) $_dkms is build.${end}
fr_fr: # ${y}* Tout est en ordre pour $(new_version) $_dkms est construit.${end}

source: #${v} Checking ${j}$(new_version)${end} ${y}$_dkms${end} build log presence${end}
fr_fr: #${v} Vérifie la présence du journal de compilation de ${j}$(new_version)${end} ${y}$_dkms${end}.${end}

source: #${v} Build and Install ${j}$(new_version)${end} ${y}$_dkms${end} DKMS modules for $KERNEL ${end}
fr_fr: #${v} Construit et installe les modules DKMS ${j}$(new_version)${end} ${y}$_dkms${end} pour $KERNEL ${end}

source: #${v} Checking ${j}$(new_version)${end} ${y}$_dkms${end} modules in $kernel_path ${end}
fr_fr: #${v} Vérifie les modules ${j}$(new_version)${end} ${y}$_dkms${end} dans $kernel_path ${end}

source: # ${ge}* Check validated (pass=$pass)${end}
fr_fr: # ${ge}* Vérification validée (pass=$pass)${end}

source: # ${ge}* Check unvalidated (pass=$pass)${end}
fr_fr: # ${ge}* Vérification non validée (pass=$pass)${end}

source: # ${y}* All Clear for $(new_version) $_dkms in $KERNEL kernel.${end}
fr_fr: # ${y}* Tout est en ordre pour $(new_version) $_dkms pour le noyau $KERNEL.${end}

source: # ${y} --- $_dkms script ended --- ${end}
fr_fr: # ${y} --- Script $_dkms achevé --- ${end}

source: # ${ge}* $_dkms $(new_version) log found.${end}
fr_fr: # ${ge}* Journal $_dkms $(new_version) trouvé.${end}

source: # ${ge}* $_dkms make log copied to $make_log_file.${end}
fr_fr: # ${ge}* Journal make $_dkms copié dans $make_log_file.${end}

source: # ${ge}* No $(new_version) $_dkms build log found.${end}
fr_fr: # ${ge}* Aucun journal make $(new_version) $_dkms trouvé.${end}

source: # ${ge}* $(new_version) ${r}FAILURE log found${end}.${end}
fr_fr: # ${ge}* ${r}Journal d'ÉCHEC $(new_version) trouvé${end}.${end}

source: #${v}${mf} Compiling ${j}$(new_version)${end} ${y}$_dkms${end} DKMS modules ${end}${end}
fr_fr: #${v}${mf} Compilation des modules DKMS ${j}$(new_version)${end} ${y}$_dkms${end}${end}${end}

source: #${y} --- $_dkms script start --- ${end}
fr_fr: #${y} --- Démarrage du script $_dkms --- ${end}

source: #${v} Done$with_error${end}
fr_fr: #${v} Fait$with_error${end}

source: # ${v}${j}($n%)${end} - Build and install DKMS modules...${end}
fr_fr: # ${v}${j}($n%)${end} - Construction et installation des modules DKMS...${end}

source: # Build and install DKMS modules.
fr_fr: # Construction et installation des modules DKMS.

source: Installing ${j}$(new_version)${end} driver over ${y}$KERNEL${end} kernel with DKMS
fr_fr: Installe le pilote ${j}$(new_version)${end} pour le noyau ${y}$KERNEL${end} avec DKMS

source: # ${ge}* Signing $mod ...${end}
fr_fr: # ${ge}* Signature de $mod ...${end}

source: # ${ge}* Compressing $module modules${end}
fr_fr: # ${ge}* Compression des modules $module${end}

source: # ${ge}* Copying $module modules in $install_path${end}
fr_fr: # ${ge}* Copie les modules $module dans $install_path${end}

source: # ${ge}* Executing $module $KERNEL depmod${end}
fr_fr: # ${ge}* Exécution de depmod pour $module $KERNEL${end}

source: #${y} --- $module Compilation done --- ${end}
fr_fr: #${y} --- Compilation $module achevée --- ${end}

source: #${v} Signing ${j}$(new_version)${end} ${y}$module${end} modules.${end}
fr_fr: #${v} Signature des modules ${j}$(new_version)${end} ${y}$module${end}.${end}

source: Installing
fr_fr: Installation

source: #${v} Reserving: Not installing, ${j}$(new_version)${end} ${y}$module${end} is not used.${end}
fr_fr: #${v} Réservation: Pas d'installation, ${j}$(new_version)${end} ${y}$module${end} n'est pas employé.${end}

source: Backup
fr_fr: Sauvegarde

source: #${j} --- ${r}ERROR${end} --- No modules found in source path --- ${end}
fr_fr: #${j} --- ${r}ERREUR${end} --- Pas de modules trouvés dans le chemin source --- ${end

source: #${v} Checking ${j}$(new_version)${end} ${y}$module${end} build log presence.${end}
fr_fr: #${v} Vérifie la présence du journal de compilation de ${j}$(new_version)${end} ${y}$module${end}.${end}

source: #${ge} * $module $(new_version) log found.${end}
fr_fr: #${ge} * Journal $module $(new_version) trouvé.${end}

source: #${ge} * $module make log copied to $make_log_file.${end}
fr_fr: #${ge} * Journal make $module copié vers $make_log_file.${end}

source: #${ge} * No $(new_version) $module build log found.${end}
fr_fr: #${ge} * Pas de journal de compilation $(new_version) $module trouvé.${end}

source: #${ge} * $module control passed (pass=$pass).${end}
fr_fr: #${ge} * Contrôle $module passé (pass=$pass).${end}

source: #${ge} * $module control not passed (pass=$pass).${end}
fr_fr: #${ge} * Contrôle $module non passé (pass=$pass).${end}

source: #${j} --- ${r}ERROR${end} --- No modules found in destination path --- ${end}
fr_fr: #${j} --- ${r}ERREUR${end} --- Pas de modules trouvés dans le chemin de destination --- ${end}

source: - ${r}with ERRORs${end}
fr_fr: - ${r}avec ERREURs${end}

source: # ${v}${mf} Compiling ${j}$(new_version)${end} from ${y}$module${end} modules source:${end}${end}
fr_fr: # ${v}${mf} Compile ${j}$(new_version)${end} depuis la source des modules ${y}$module${end}:${end}${end}

source: #${y} --- $module compilation start --- ${end}
fr_fr: #${y} --- Démarrage de la compilation $module --- ${end}

source: #${ge} Compilation $make_env.${end}
fr_fr: #${ge} Compilation de $make_env.${end}

source: # ${v}Source ${j}$(new_version)${end} ${y}$module${end} unaviable.${end}
fr_fr: # ${v}Source ${j}$(new_version)${end} ${y}$module${end} non disponible.${end}

source: # ${v}Check your kernel source three.${end}
fr_fr: # ${v}Vérifiez l’arborescence des sources noyau.${end}

source: #${v} Done$with_error.${end}
fr_fr: #${v} Fait$with_error.${end}

source: # Build & install modules from source...
fr_fr: # Construction & installation des modules depuis le répertoire source...

source: Installing ${y}$KERNEL${end} kernel modules from ${j}$(new_version)${end} source directory
fr_fr: Installe les modules noyau ${y}$KERNEL${end} depuis répertoire source ${j}$(new_version)${end}

source: # ${r}${j}($n%)${end} DKMS compilation ERROR !!${end}
fr_fr: # ${r}${j}($n%)${end} ERREUR de compilation DKMS !!${end}

source: # ${v}${j}($n%)${end} - Nvidia MODULES compilation from source...${end}
fr_fr: # ${v}${j}($n%)${end} - Compilation des MODULES Nvidia depuis la source...${end}

source: # DKMS compilation ERROR !!
fr_fr: # ERREUR de compilation DKMS !!

source: # Nvidia MODULES compilation from source...
fr_fr: # Compilation des MODULES Nvidia depuis la source...

source: # Updating $KERNEL modules.
fr_fr: # Mis à jour des modules $KERNEL.

source: # Exec $KERNEL modules reload
fr_fr: # Exécute le rechargement des modules $KERNEL

source: # Rebuilding $KERNEL INITRAMFS ($m sec.)
fr_fr: # Reconstruction de l'INITRAMFS $KERNEL ($m sec.)

source: # ERROR ! $KERNEL modules do not match $(new_version). Abort.
fr_fr: # ERREUR ! Les modules $KERNEL ne correspondent pas à $(new_version). Abandon.

source: # ${v}${j}($n%)${end} - ${mf}Install Nvidia default libraries${end}${end}
fr_fr: # ${v}${j}($n%)${end} - ${mf}Installation des librairies Nvidia par default${end}${end}

source: Installing ${j}$(new_version)${end} libraries to $nv_root/nvidia.$(new_version)
fr_fr: Installation des librairies ${j}$(new_version)${end} vers $nv_root/nvidia.$(new_version)

source: # ${j}<b>libraries installation in background</b>${end}
fr_fr: # ${j}<b>Installation des librairies en arrière plan</b>${end}

source: # ${y}Please wait...${end}
fr_fr: # ${y}Patientez s'il vous plait...${end}

source: ${vB}Nvidia-installer:\t\t${end}${jB} no effect\t${end}> ${y}WARNING on missing /usr/lib(32/64)/LibGL.so link,\n\t\t\t\t\t\t LibGL.so is already link in default nvidia's libraries directory${end}.\n
fr_fr: ${vB}Nvidia-installer:\t\t${end}${jB} pas effet\t${end}> ${y}ALERTE sur lien /usr/lib(32/64)/LibGL.so manquant,\n\t\t\t\t\t\t LibGL.so est déjà lié dans le répertoire par défaut de nvidia${end}.\n

source: \t\t\t\t${jB} no effect\t${end}> ${y}WARNING missing libglvnd developpement files.${end}\n
fr_fr: \t\t\t\t${jB} pas effet\t${end}> ${y}ALERTE fichier de développement libglvnd manquant.${end}\n

source: ${v}${r}LIBS INSTALL CONTROL RETURN ERRORS.${end}.\nCheck $lib_logfile for more details.${end}
fr_fr: ${v}${r}LE CONTRÔLE DES LIBRAIRIES A RETOURNE DES ERREURS.${end}.\nVérifiez $lib_logfile pour plus de détails.${end}

source: Abort install
fr_fr: Abandon de l'installation

source: ${vB}Libraries install:\t\t${end}${gB} success\t${end}> ${y}normal install process${end}.\n
fr_fr: ${vB}Installation des librairies:\t${end}${gB} succès\t${end}> ${y}processus d'installation normal${end}.\n

source: # Modules build done.
fr_fr: # Construction des modules achevée.

source: # ${v}${j}($n%)${end} - Modules build done.${end}
fr_fr: # ${v}${j}($n%)${end} - Construction des modules achevée.${end}

source: ${vB}Driver build$show_dkms:\t\t${end}${gB} success\t${end}> ${y}Installation complete with no error${end}\n
fr_fr: ${vB}Contruction pilote$show_dkms:\t${end}${gB} succès\t${end}> ${y}Installation complétée sans erreur${end}\n

source: # Modules build ERROR.
fr_fr: # ERREUR de construction des modules.

source: # ${r}${j}($n%)${end} - Modules build ERROR.${end}
fr_fr: # ${r}${j}($n%)${end} - ERREUR de construction des modules.${end}

source: ${vB}Driver build:\t\t\t${end}${rB} failure\t${end}> ${y}ERROR, 'make' exit with 'failed' state${end}\n
fr_fr: ${vB}Contruction pilote:\t\t${end}${rB} échec\t\t${end}> ${y}ERREUR, 'make' à quitté avec l'état 'failed'${end}\n

source: $(cat <<-ERROR ${r}MODULES BUILD RETURN ERRORS.${end}. $(new_version) compilation failed. Source make.log has been saved in <i>$make_log_file</i>. Do you want to read $make_log_file ? ERROR )
fr_fr: $(cat <<-ERROR ${r}LA CONSTRUCTION MODULES A RETOURNÉ DES ERREURS.${end}. La compilation $(new_version) a échoué. Le make.log source a été sauvegardé dans <i>$make_log_file</i>. Voulez-vous lire le journal $make_log_file ? ERROR )

source: No thanks, shits happens
fr_fr: Non merci, ce sont des choses qui arrivent

source: ${j}$(new_version)${end} compilation log text
fr_fr: Journal de compilation ${j}$(new_version)${end}

source: # Modules already build and present in $kernel_path.
fr_fr: # Les modules sont déjà compilés et présent dans $kernel_path.

source: # ${y}${j}($n%)${end} - Modules already build and present in $kernel_path.${end}
fr_fr: # ${y}${j}($n%)${end} - Les modules sont déjà compilés et présent dans $kernel_path.${end}

source: $(cat <<-ERROR ${r}<b>MODULES ALREADY BUILD</b>${end} $(new_version) is the same as in kernel path. If you decide to continue anyway, consider the section ${j}update driver${end} > ${j}update driver only${end} or restoring $(new_version) backup, if you experience any issue. What do you want to do ? ERROR )
fr_fr: $(cat <<-ERROR ${r}<b>MODULES DÉJÀ CONSTRUIT</b>${end} $(new_version) est la même que celle du noyau. Si vous décidez de continuer malgré tout, considérez la section ${j}Mettre à jour les pilotes${end} > ${j}Mettre à jour les pilotes uniquement${end} ou restaurer la sauvegarde $(new_version), si vous rencontrez des problèmes. Que voulez-vous faire ? ERROR )

source: \t\t\t\t${gB} kernel option ${end}>${y} Kernel $KERNEL is REALTIME${end}.\n
fr_fr: \t\t\t\t${gB} option kernel ${end}>${y} le noyau $KERNEL est REALTIME${end}.\n

source: open driver loaded
fr_fr: pilote Ouvert utilisé

source: close source loaded
fr_fr: pilote propriétaire utilisé

source: ${vB}Open Driver:\t\t\t${end}${gB} compiled\t${end}>${y} $append${end}\n
fr_fr: ${vB}Pilote Ouvert:\t\t${end}${gB} compilé\t${end}>${y} $append${end}\n

source: ${j}${bf}Install Report${end}${end}${v}\n\n $(cat <<< ${report_log[*]})${end}\n$rep_msg
fr_fr: ${j}${bf}Rapport d'installation${end}${end}${v}\n\n $(cat <<< ${report_log[*]})${end}\n$rep_msg

source: edit later
fr_fr: éditer plus tard

source: edit now
fr_fr: éditer maintenant

source: $(cat <<-WRN $menu_msg ${v}Installing driver ${j}$(new_version)${end} for hardware : ${j}$install_dev${end}${end}. WRN )
fr_fr: $(cat <<-WRN $menu_msg ${v}Installation du pilote ${j}$(new_version)${end} pour le matériel : ${j}$install_dev${end}${end}. WRN )

source: Installing ${j}$(new_version)${end} driver version for ${y}$dev_name${end}.
fr_fr: Installation du pilote version ${j}$(new_version)${end} pour ${y}$dev_name${end}.

source: # ${v}${j}($n%)${end} - ${mf}Compat check and package extraction${end}${end}
fr_fr: # ${v}${j}($n%)${end} - ${mf}Vérification de la compatibilté et extraction des paquets${end}${end}

source: # ${v}${j}($n%)${end} - Checking compatibility data files${end}
fr_fr: # ${v}${j}($n%)${end} - Vérification du fichier de données de compatibilités${end}

source: # ${v}${j}($n%)${end} - Backing up old driver version, if any${end}
fr_fr: # ${v}${j}($n%)${end} - Sauvegarde de l'ancienne version du pilote, si besoin${end}

source: # ${y}${j}($n%)${end} - Driver already backed up. Skipped.${end}
fr_fr: # ${y}${j}($n%)${end} - Pilote déjà sauvegardé. Passé.${end}

source: ${vB}Previous version:\t\t${end}${gB} passed\t${end}> ${y}previously backed up${end}\n
fr_fr: ${vB}Version précédente:\t\t${end}${gB} passé\t\t${end}> ${y}Déjà sauvegardée${end}\n

source: Backup : $bak_version backup archive creation
fr_fr: Sauvegarde : Création de l'archive de sauvegarde $bak_version

source: ${vB}Previous version:\t\t${end}${gB} success\t${end}> ${y}$bak_version normal backup process${end}\n
fr_fr: ${vB}Version précédente:\t\t${end}${gB} succès\t${end}> ${y}$bak_version, processus normal de sauvegarde${end}\n

source: ${vB}Previous version:\t\t${end}${jB} warning\t${end}> ${y}no directory to archive.${end}\n
fr_fr: ${vB}Version précédente:\t\t${end}${jB} alerte\t${end}> ${y}pas de dossier à archiver.${end}\n

source: # ${v}${j}($n%)${end} - ${mf}Starting install${end}${end}
fr_fr: # ${v}${j}($n%)${end} - ${mf}Démarrage de l'installation${end}${end}

source: # ${v}${j}($n%)${end} - Package compil and install${end}
fr_fr: # ${v}${j}($n%)${end} - Compilation et installation du paquet${end}

source: # ${y}${j}($n%)${end} - Old Nvidia serie BUG - driver install lost.${end}
fr_fr: # ${y}${j}($n%)${end} - BOGUE des anciennes séries Nvidia - installation pilote perdu.${end}

source: # ${y}${j}($n%)${end} - Restoringg from backup.${end}
fr_fr: # ${y}${j}($n%)${end} - Restauration depuis une sauvegarde.${end}

source: # ${v}${j}($n%)${end} - ${mf}Linking ${y}$(new_version)${end} directory to the system.${end}${end}
fr_fr: # ${v}${j}($n%)${end} - ${mf}Liaison du dossier ${y}$(new_version)${end} au système.${end}${end}

source: # ${v}${j}($n%)${end} - ${mf}Re-create ${j}$KERNEL${end} initramfs.${end}${end}
fr_fr: # ${v}${j}($n%)${end} - ${mf}Recréation de l'initramfs de ${j}$KERNEL${end}.${end}${end}

source: # ${ge}${sf} * ($m%) Exec $KERNEL modules init/reload${end}${end}
fr_fr: # ${ge}${sf} * ($m%) Exécution de init/reload des modules $KERNEL${end}${end}

source: # ${v}${j}($n%)${end} - Backup new Nvidia-Installer to $nvdir${end}
fr_fr: # ${v}${j}($n%)${end} - Sauvegarde du nouveau Nvidia-Installer vers $nvdir${end}

source: # ${v}${j}($n%)${end} - Update new driver version file${end}
fr_fr: # ${v}${j}($n%)${end} - Mise à jour du fichier de version pilote${end}

source: # ${v}${j}($n%)${end} - Driver $(new_version) release package backup success${end}
fr_fr: # ${v}${j}($n%)${end} - Succès de la sauvegarde du nouveau pilote $(new_version)${end}

source: # ${v}${j}($n%)${end} - Driver ${j}$(new_version)${end} release backup mistake. Not fatal.${end}
fr_fr: # ${v}${j}($n%)${end} - Erreur de la sauvegarde du nouveau pilote $(new_version)${end}. Non fatal.${end}

source: # ${v}${j}($n%)${end} - nv-update-$(new_version) already present in path, skip${end}
fr_fr: # ${v}${j}($n%)${end} - nv-update-$(new_version) déjà présent dans le chemin de stockage, passé.${end}

source: $(cat <<-RPT ${v}<b><big><i>Congratulations !</i></big></b>${end} <b>${j}$(new_version)${end} ${v}driver is now succefully installed${end}</b>. ${v}You may now configure your ${j}xorg.conf${end} file to fit with your current default display before restarting your computer with the new installed drivers. You may also do it later if you like, but it's not really recommanded. What do you want to do ?${end} RPT )
fr_fr: $(cat <<-RPT ${v}<b><big><i>Féliciations !</i></big></b>${end} <b>${v}Le pilote ${j}$(new_version)${end} est maintenant installé avec succès${end}</b>. ${v}Vous devriez maintenant configurer votre fichier ${j}xorg.conf${end} pour correspondre avec votre affichage courant avant de redémarrer votre ordinateur avec les nouveaux pilotes installés. Vous pouvez aussi le faire plus tard, mais ce n'est pas réellement recommandé. Que voulez-vous faire ?${end} RPT )

source: for Nvidia drivers
fr_fr: pour les pilotes Nvidia

source: $(cat <<-WARN ${y}<b>Xorg configuration file${is_nv} has been change</b>${end} <b>WARNING</b> : <b>Xorg file already exist</b>. Validating will overwrite this file by a fresh one. <small><i>A backup of previous will be made in /etc/X11 (xorg.conf.[nvidia]~)</i></small> Do you want to overwrite ? WARN )
fr_fr: $( cat <<-WARN ${y}<b>Le fichier de configuration Xorg${is_nv} a été changé</b>${end} <b>ATTENTION</b> : <b>Le fichier Xorg existe déjà</b>. La validation écrasera ce fichier par un nouveau. <small><i>Une sauvegarde de l'ancien sera faite dans /etc/X11 (xorg.conf.[nvidia]~)</i></small> Voulez-vous écraser ? WARN )
