Repository: wildtruc/zenvidia
Catalog: locale/locale_dev/*.po
Languages: fr_fr

source: $(cat <<-MSG ${r}<big><b>A Free Nvidia drivers manager</b></big>${end} ${y}Close and Open Source versions support${end} ${vB}System :${end}${ge} ${end}${j}$(distro_name)${end} ${vB}Processor type :${end}${ge} ${end}${j}$ARCH${end} $(devices) ${vB}Driver version installed :${end} ${j}$(drv_installed)${end}$restore_msg ${vB}Kernel version :${end}${ge} ${end}${j}$KERNEL${end} ${vB}GCC version :${end}${ge} ${end}${j}$GCC${end} ${vB}NVIDIA binary version :${end}${ge} ${end}${j}$NV_bin_ver${end}$restore_msg $(open_check) ${v}Network connection :${end} ${j}$cnx_msg${end} ${v}Rights :${end} ${j}$(right_check)${end} ${hlp_wrn} ${v}What do you want to do ?${end} MSG )
fr_fr: $(cat <<-MSG ${r}<big><b>Un gestionnaire Libre des pilotes Nvidia</b></big>${end} ${y}Support des versions Propriétaire et Open Source${end} ${vB}Système :${end}${ge} ${end}${j}$(distro_name)${end} ${vB}Type de processeur :${end}${ge} ${end}${j}$ARCH${end} $(devices) ${vB}Version pilote installé :${end} ${j}$(drv_installed)${end}$restore_msg ${vB}Version noyau :${end}${ge} ${end}${j}$KERNEL${end} ${vB}Version GCC :${end}${ge} ${end}${j}$GCC${end} ${vB}Exécutable Nvidia :${end}${ge} ${end}${j}$NV_bin_ver${end}$restore_msg $(open_check) ${v}Connexion réseau :${end} ${j}$cnx_msg${end} ${v}Droits :${end} ${j}$(right_check)${end} ${hlp_wrn} ${v}Que voulez-vous faire ?${end} MSG )

source: Install drivers
fr_fr: Installer des Pilotes

source: Update drivers or modules
fr_fr: Mettre à jour les pilotes et modules

source: Configuration and Tools
fr_fr: Outils et Configurations

source: Help and Documentation
fr_fr: Aide et Documentation

source: ${red} # No zenvidia script conf file found. Abort.${nc}
fr_fr: ${red} # Pas de fichier de configuration Zenvidia trouvé. Abandon.${nc}

source: ${red} # No distribution conf file found.${nc}
fr_fr: ${red} # Pas de fichier de configuration distribution trouvé.${nc}

source: ${cya} # If your distribution needs special variables or dependencies,${nc}
fr_fr: ${cya} # Si votre distribution demande des dépendances ou des variables spéciales,${nc}

source: ${cya} # please relaunch zenvidia and edit the special file as appropriate.${nc}
fr_fr: ${cya} # relancez Zenvidia et éditez le fichier spécial comme approprié.${nc}

source: $(cat <<-WRN ${j}<b>No distribution special file found or configured</b>${end} If you distribution needs special variables or dependencies to be set, please relaunch Zenvidia and go to : <b>Configuration and Tools</b> menu » <b>Edit distro config</b> There edit the file as appropriate. WRN )
fr_fr: $(cat <<-WRN ${j}<b>Pas de fichier spécial de distribution trouvé ou configuré</b>${end} Si votre distribution demande des dépendances ou des variables spéciales, relancez Zenvidia et allez au menu : <b>Outils et Configuration</b> » <b>Éditer la configuration de la distribution</b> Là, éditez le fichier comme approprié. WRN )

source: Back to menu
fr_fr: Revenir au menu

source: Back to index
fr_fr: Retour à l'index

source: Back to list
fr_fr: Retour à la liste

source: Back to previous
fr_fr: Retour au précédent

source: Previous menu
fr_fr: Menu précédent

source: Back to main
fr_fr: Menu principal

source: Yes
fr_fr: Oui

source: Read
fr_fr: Lire

source: Write
fr_fr: Écrire

source: Ok
fr_fr: D'accord

source: Apply
fr_fr: Appliquer

source: Got it
fr_fr: J'ai compris

source: Set
fr_fr: Valider

source: Continue
fr_fr: Continuer

source: Overwrite
fr_fr: Écraser

source: Keep
fr_fr: Conserver

source: Proceed
fr_fr: Procéder

source: Select
fr_fr: Sélectionner

source: Yes, please
fr_fr: Oui, s'il vous plaît

source: No thanks
fr_fr: Non merci

source: Back
fr_fr: Retour

source: Previous
fr_fr: Précédent

source: Cancel
fr_fr: Annuler

source: Close
fr_fr: Fermer

source: No
fr_fr: Non

source: Exit
fr_fr: Sortie

source: Abort
fr_fr: Abandon

source: Abort installation
fr_fr: Abandon de l'installation

source: ${v}What do you want to do ?${end}
fr_fr: ${v}Que voulez-vous faire ?${end}

source: What do you want to do ?
fr_fr: Que voulez-vous faire ?

source: Open Driver Switch
fr_fr: Permutation Pilote Ouvert

source: PRIME Display configuration
fr_fr: Configuration PRIME Display

source: Read ${version} change log
fr_fr: Journal des changements ${version}

source: Nvidia ${version} documentation
fr_fr: Documentation Nvidia ${version}

source: <b>$version</b> in use. <small>($adds)</small>
fr_fr: <b>$version</b> actif. <small>($adds)</small>

source: no driver detected
fr_fr: aucun pilote détecté

source: Read Zenvidia change log
fr_fr: Journal des changements Zenvidia

source: Start zenvidia
fr_fr: Démarrer Zenvidia

source: Nvidia Settings (user)
fr_fr: Nvidia Settings (utilisateur)

source: Config xorg
fr_fr: Configuration Xorg

source: Edit Zenvidia configuration
fr_fr: Éditer la configuration Zenvidia

source: Check Nvidia driver Update
fr_fr: Contrôle des mises à jour Nvidia

source: Zenvidia About
fr_fr: À propos de Zenvidia

source: Close Zenvidia task menu
fr_fr: Fermer le menu Zenvidia

source: update
fr_fr: mise à jour

source: $LAST_DRV, official driver
fr_fr: $LAST_DRV, pilote officiel

source: $LAST_BETA, beta driver
fr_fr: $LAST_BETA, pilote bêta

source: $LAST_DRV, official drivers
fr_fr: $LAST_DRV, pilotes officiels

source: $sol<b>$driver</b> $release update.\n<i>(not dowloadable yet)</i>$eol
fr_fr: ${sol}<b>$driver</b>$release, mise à jour.\n<i>(non téléchargeable)</i>$eol

source: ${notif_msg[*]}$msg_suffix
fr_fr: $msg_suffix ${notif_msg[*]}

source: Nvidia driver
fr_fr: Pilote Nvidia

source: Nvidia driver notification
fr_fr: Notification pilote Nvidia

source: <b>WARNING</b> : No Signal
fr_fr: <b>ATTENTION</b> : Pas de signal

source: and Zenvidia
fr_fr: et Zenvidia

source: ${line}zenvidia git repo update.\n$git_rm_fetch_date $git_rm_version
fr_fr: ${line}Mise à jour GIT Zenvidia.\n$git_rm_fetch_date $git_rm_version

source: ${line}zenvidia git warning.\n$git_rm_fetch_date $git_rm_warn_log
fr_fr: ${line}Alerte GIT Zenvidia.\n$git_rm_fetch_date $git_rm_warn_log

source: <b>ZENVIDIA</b> is a bash/zenity script for managing NVIDIA© propriatary drivers. <b>A brief History</b> I started <b>Zenvidia</b> several years ago in a background of non existent <i>Nvidia</i> drivers managed by distros. I builded it with a light knowledge of bash code I was learning on the scratch and with the only goal of my own use. I finally brought it to the community, with all my knowledge gaps, and maintained it for a couples of years until my health prevent me to go on and I throw the sponge, hoping someone somewhere one day will continue or make a new one. Despite my personal condition I went by time back in the code to add, change some little things because I was still using it, and despite the fact that my distro was delivering Nvidia drivers, <b>Zenvidia</b> was still more flexible. Then, the <b>515 drivers</b> series went out with the open source drivers ! Woaw ! So cool ! ... but not really. Yeah, it was a big step for Nvidia to bring their drivers to a mix of Open Source and GPL. Alas, as always Nvidia's old school linux drivers developpers put brut terminal only tools, event not a possibility to test and switch back. I don't blame them, rewrite all Nvidia-installer for a fantasque user ideal is simply not possible, too much code in it. I wasn't at the top on my shape, but as always, I decided to put that in <b>Zenvidia</b>. <b>A Brief of Consequencies</b> Going back to Zenvidia bash code after a so long suspend was not a piece of cake and take me at several months to understand the clean way to make a fast switch and even wash the code of all the useless things. Now it's done and because sometimes my brain could went out with its pols without notice, <i>I'm still doing very strange things sometimes</i> and that's why I couldn't consider the code as really maintained. I can't warant the quality of the service even if I'm bringing more and more features. I'm probably nut. I just hope that you, guys, will enjoy using my toy, because, as I know, there is still no equals in the whole linux community. <b>A brief about Features</b> * <b>Driver install</b> - from local stocks or from remote Nvidia server's package. - from a downloaded package (anywhere in system). - New and legacy drivers managed. * <b>Updates</b> - driver updates and compatibility check. - Newly installed kernel update (dkms, could force from source). * <b>Configuration and Tools</b> - Edit xorg.conf file. - Edit Zenvidia config file. - Start Nvidia-Settings. - Installed driver archives management (remove, backups). - Open driver switch tool. - Prime Display tool. - ( and more ...) * <b>Help and Documentation</b> - Nvidia driver manuel : Installed version driver manual with graphic chaptered index. - Nvidia driver Changelog : Installed version and general driver changelog with graphic chaptered index. - Zenvidia help text : Simple Zenvidia help text file display. - Zenvidia About text (yes, this is me!) : About Zenvidia text file display. * <b>More</b> - Command line rescue tools to restore, driver compil, etc. <i>(displayed with X server off only)</i>
fr_fr: <b>ZENVIDIA</b> est script bash/yad (ex zenity) pour gérer les pilotes propriétaire et open source NVIDIA© <b>Une brève d'histoire</b> J'ai commencé <b>Zenvidia</b> il y a de nombreuses années avec en arrière-plan la non existence de gestion des pilotes <b>nvidia</b> par les distributions. Je l'ai démarré avec une connaissance très succincte du code bash que j'apprenais sur le tas et avec l'unique objet de mon propre usage. Je l'ai finalement apporté à la communauté, malgré toutes mes lacunes, et maintenu durant quelques années jusqu'à ce que ma santé me restreigne et j'ai fini par jeter l'éponge, espérant que quelqu'un quelque part reprenne le flambeau un jour ou en crée un nouveau. Malgré ma condition, j'ai continué à revenir sur le code de temps en temps pour corriger, ajouter des choses ici et là car je continuait à l'utiliser et malgré le fait que ma distribution fournissait des pilotes Nvidia, Zenvidia demeurait plus flexible. Puis, la série <b>515</b> est sortie avec les pilotes open source ! Woa ! Tellement cool... mais pas vraiment en fait. Oui, c'était un grand pas pour Nvidia de transposer leur pilote à un mélange de GPL et d'Open source. Hélas, les développeurs "old school" de Nvidia restait avec la méthode terminal brute, sans la possibilité de tester et revenir. Je ne les blâme pas, réécrire intégralement nvidia-installer juste pour les désirs fantasque d'un utilisateur est simplement impossible, bien trop de code là-dedans. J'étais loin d'être au sommet de ma forme, mais comme toujours, je n'ai pas résisté à l'idée de l'ajouter à <b>Zenvidia</b>. <b>Une brève des conséquences</b> Revenir au code de Zenvidia après un arrêt si long ne fut pas une mince affaire, et cela me prit des mois pour comprendre la bonne méthode pour faire une permutation rapide entre les versions et aussi nettoyer les nombreuses erreurs et l'inutile. Désormais, c'est fait. Et parce que je ne sais jamais quand mon cerveau risque de partir en vadrouille avec ses potes, <i>je continue de faire des choses très étrange de temps en temps</i> et c'est pourquoi je ne peux pas considérer le code comme vraiment maintenu, je ne peux pas garantir la qualité du service, même et surtout que je continue à y apporter de plus en plus de fonctionnalités. Je suis probablement neuneu. <b>Une brève des fonctionnalités</b> * <b>Installation du pilote</b> - Depuis un paquet du stock local ou du serveur Nvidia. - Depuis un paquet téléchargé. - Gestion des nouveau et ancien pilotes. * <b>Mettre à jour</b> - Contrôle des mise à jour des pilotes et des compatibilités. - Lise à jour des nouveaux noyau (dkms, peut être forcé depuis les sources). * <b>Outils et Configuration</b> - Édition du fichier de configuration Xorg. - Édition de la configuration Zenvidia. - Démarrer Nvidia-Settings. - Gestion des archives de sauvegarde (supprimer, sauvegarder, etc). - Permutation de pilote Open. - Outil Prime Display. - ( et plus ...) * <b>Aides et Documentation</b> - Manuel du pilote Nvidia : Manuel indexé et chapitré de la version installée. - Journal des modifications Nvidia : Journal indexé et chapitré des versions installée et antérieure. - Aide Zenvidia : Simple fichier texte d'aide pour Zenvidia. - À propose de Zenvidia (oui, c'est moi !) : Affichage de ce fichier texte. * <b>More</b> - Outils de récupération, compilation, etc, en ligne de commande <i>(Affiché quand le serveur X éteint)</i>
