Repository: wildtruc/zenvidia
Catalog: locale/locale_dev/*.po
Languages: fr_fr

source: $(cat <<-MSG <b><big>Zenvida didn't find any optional Distro config file for $plug_version</big></b> <b>Su command are not congigured</b> Without a proper <b>su</b> command prompt, Zenvidia main functions are unusable and script will abort. Please, enter <b>sudo</b> or <b>su</b> command line with options for default user admin privilege. <i>If you don't know what is talking about here, just abort. </i> MSG )
fr_fr: $(cat <<-MSG <b><big>Zenvida n'a pas trouvé de fichier optionnel de configuration pour $(distro_version)</big></b> <b>La commande SU n'est pas congigurée</b> Sans un appel de la commande <b>su</b> approprié, Zenvidia les fonctions principales de Zenvidia sont inutilisables et le script quittera. SVP, entrer la ligne de commande <b>sudo</b> ou <b>su</b> avec les options par défaut de privilèges administrateurs. <i>Si vous ne savez pas de quoi on parle ici, quitter simplement. </i> MSG )

source: <b>Distribution name</b>
fr_fr: <b>Nom de la distribution</b>

source: Enter the name of the distribution if not displayed.
fr_fr: Entrer le nom de la distribution si non affiché.

source: <b>su command line</b>
fr_fr: <b>ligne de commande su</b>

source: Select a commande in the list or type one.
fr_fr: Sélectionner une commande dans la liste ou en entrer une.

source: ${red}XTERM missing, installing ...${nc}
fr_fr: ${red}XTERM manquant, installation ...${nc}

source: $(cat <<-DEP <b>Script Dependencies Check</b> Required dependencies are not met. ${dep_text[@]} are missing. DEP )
fr_fr: $(cat <<-DEP <b>Contrôle des dépendances</b> Les dépendances requises n'ont pas été trouvées. ${dep_text[@]} sont manquantes. DEP )

source: $(cat <<-DEP $warn_text Will you install them now ? DEP )
fr_fr: $(cat <<-DEP $warn_text voulez-vous les installer maintenant ? DEP )

source: Depencies installation, please wait . . .
fr_fr: Installation des dépendances, patientez . . .

source: $(cat <<-DEP $warn_text <b>Your are not administrator</b>. You need to restart with adminsitratior privileges or use your packages manager to install them. DEP )
fr_fr: $(cat <<-DEP $warn_text <b>Vous n'êtes pas administrateur</b>. Vous devez redémarrer avec les privilèges administrateurs ou utiliser le gestionnaire de paquets pour les installer. DEP )

source: $(cat <<-DEP read -p "Will you install them now ? (Y/N) :" confirm if [[ "\$confirm" =~ [yY] ]]; then echo -e "\n${grn}Depencies installation, please wait . . .${nc}\n" $(pkg_install_cmd) ${deplist[*]} sed -i "s/resolve_dep=.*/resolve_dep=1/" $script_conf else echo -e "\n${red}Those dependencies are mandatory for Zenvidia.${nc}\n" echo -e "If you don't want Zenvidia to install them automatically," echo -e "you need to use your packages manager instead" echo -e "BYE !" fi DEP )
fr_fr: $(cat <<-DEP read -p "Voulez-vous les installer maintenant ? (O/N) :" confirm if [[ "\$confirm" =~ [oO] ]]; then echo -e "\n${grn}Installation des dépendances, patientez SVP . . .${nc}\n" $(pkg_install_cmd) ${deplist[*]} sed -i "s/resolve_dep=.*/resolve_dep=1/" $script_conf else echo -e "\n${red}Ces dépendances sont requises pour Zenvidia.${nc}\n" echo -e "Si vous ne voulez pas que Zenvidia les installe automatiquement," echo -e "vous devez utiliser le gestionnaire de paquets à la place" echo -e "BYE !" fi DEP )

source: $(cat <<-DEP echo -e "Zenvidia is start without admin privileges." echo -e "You need to restart with ${red}Zenvidia (admin)${nc} to install them." DEP )
fr_fr: $(cat <<-DEP echo -e "Zenvidia a démarré sans privilèges administrateurs." echo -e "Vous devez redémarrer ${red}avec ces privilèges${nc} pour l'installation." DEP )

source: $(cat <<-DEP #set -x echo -e "${red}Script Dependencies Check${nc}\n" echo -e "Required dependencies are not met.\n" echo -e "${dep_text[*]}\n" $EXEC echo -e "\n${cya}***** Close window to escape *****${nc}" DEP )
fr_fr: $(cat <<-DEP #set -x echo -e "${red}Contrôle des dépendances${nc}\n" echo -e "Les dépendances requises n'ont pas été trouvées.\n" echo -e "${dep_text[*]}\n" $EXEC echo -e "\n${cya}***** Fermer la fenêtre pour quitter *****${nc}" DEP )

source: ${red}NO PACKAGE INSTALLER FOUND, ABORTING.${nc}\n
fr_fr: ${red}AUCUN PROGRAMME D'INSTALLATION TROUVÉ, ABANDON.${nc}\n

source: $(cat <<-MSG No internet connection detected. A valid network connection is required for any download. MSG )
fr_fr: $(cat <<-MSG Pas de connxion internet détectée. Un connexion valide est requise pour les téléchargements. MSG )

source: NONE
fr_fr: AUCUNE

source: Connected
fr_fr: Connecté

source: $(cat <<-ERR ${j}${bf}Version text file not found.${end}${end} Look like driver isn't installed initialy. Go to ${y}<b>» Main menu » Install drivers</b>${end} first. ERR )
fr_fr: $(cat <<-ERR ${j}${bf}Fichier de version introuvable.${end}${end} Il semblerait que les pilotes ne soient pas encore installés. Allez en premier lieu dans ${y}<b>» Menu principal » Installer des pilotes</b>${end}. ERR )

source: \n${nc}***** Close window to escape *****
fr_fr: \n${nc}***** Fermer la fenêtre pour quitter *****

source: \n${nc}***** Window will auto-close in ${xt_delay} seconds *****
fr_fr: \n${nc}***** La fenêtre fermera dans ${xt_delay} secondes *****

source: $(cat <<-MSG ${jB}Nvidia Open Source Modules${end} ${vB}Since 515 driver series, it is possible to use nvidia open source drivers By default, Zenvidia will build them alongside the main ones. AT THIS POINT, OPEN SOURCE DRIVERS WILL BE ONLY BUILD. You will be able to switch between version with the ${j}Open Driver Switch Tool${end} in ${j}Configuration and Tools${end} menu (restart Zenvidia is mandatory). ${j}WARNING ${end}:${v}<i> Open drivers are in still in early state, many features are not accessible at this point. Check progress in Nvidia Changelog update regulary</i>.${end} Do you want to build open source drivers ?${end} MSG )
fr_fr: $(cat <<-MSG ${jB}Modules Open Source Nvidia${end} ${vB}Depuis la série de pilotes 515, il est possible d'utiliser les pilotes open source Par défault, Zenvidia les construira parallèlement aux principaux. À PARTIR DE CE POINT, LES PILOTES OPEN SOURCE NE SERONT QUE CONSTRUIT. Il vous sera permis de basculer de l'un à l'autre avec l'outil ${j}Permutation de pilote${end} à partir du menu ${j}Outils et Configuration${end} (redémarrer Zenvidia est nécessaire). ${j}AVERTISSEMENT ${end}:${v}<i> Les pilotes Open source sont encore jeunes, beaucoup de fonctionnalités ne sont pas encore actuellement accessibles. Consultez régulièrement le Changelog de Nvidia lors des mises à jour</i>.${end} Voulez-vous ajouter les pilotes Open Source ?${end} MSG )

source: $(cat <<-MSG ${jB}Nvidia Open Source Modules${end} ${j}WARNING ${end}:${vB}By default, Zenvidia send alert about open driver building, If you select ${j}<i>NO</i>${end} here, the previous window won't be displayed again. ${v}<i>(Choice will be saved in configuration file and could be changed)</i>${end} Do you want to be warn at each drivers upgrade ?${end} MSG )
fr_fr: $(cat <<-MSG ${jB}Nvidia Module Open Source${end} ${j}AVERTISSEMENT ${end}:${vB}Par défaut, Zenvidia affiche une alerte pour les pilotes ouverts, Si vous électionnez ${j}<i>NON</i>${end} ici, la fenêtre précédente ne s'affichera plus. ${v}<i>(Votre choix sera sauvegardé et pourra changer dans le fichier de configuration)</i>${end} Voulez-vous être averti à chaque mise à niveau ?${end} MSG )

source: $(cat <<-TXT ${rBB}REALTIME Kernel Detected${end} ${vB}ATTENTION :${v} You are about to install driver on a realtime kernel. Don't forget Nvidia drivers is not normaly made for realtime. Troubles init at boot time could happen. Think about making a root partition backup if you have no fallback. ${j}"<b> dd if=/dev/sdxx of=root.img bs=1024k status=progress </b>"${end} (from a live usb) Do you really want to use compilation over realtime kernel ?${end}${end} TXT )
fr_fr: $(cat <<-TXT ${rBB}Noyaux REALTIME détecté${end} ${vB}ATTENTION :${v} Vous allez installer un pilote pour un noyau en temps réel. Ne perdez de vue que les pilotes Nvidia ne sont pas conçus pour le temps réel. Des problèmes peuvent surgir à l'initialisation du système. Songez à faire un sauvegarde de la partition racine si aucun noyau alternatif présent. ${j}"<b> dd if=/dev/sdxx of=root.img bs=1024k status=progress </b>"${end} (depuis une usb live) Voulez-vous vraiment compiler pour un noyau en temps réel ?${end}${end} TXT )

source: not installed
fr_fr: non installé

source: $(cat <<-WRN ${j}<b>No tool were found to rebuild initramfs</b>${end} Modprobe reload could work for the used kernel, but probably not for an extra kernel. Updated Modules wont probably load at reboot. You have been warn ! WRN )
fr_fr: $(cat <<-WRN ${j}<b>Aucun outils trouvé pour refaire l'initramfs</b>${end} La commande Modprobe reload peut fonctionner pour le noyau en cours, mais probablement pas pour un alternatif. Les modules ne se chargeront probablement pas au redémarrage. Vous avez été averti ! WRN )

source: #${j} ** Restoring previous drivers to $kernel_path ** ${end}
fr_fr: #${j} ** Restauration des pilotes précédent dans $kernel_path ** ${end}

source: # ${ge}${sf} * Depmod $KERNEL modules ($m sec.)${end}${end}
fr_fr: # ${ge}${sf} * Depmod des modules $KERNEL ($m sec.)${end}${end}

source: #${j} ** Restoring drivers to $kernel_path ** ${end}
fr_fr: #${j} ** Restaure les pilotes vers $kernel_path ** ${end}

source: # ${yel}Uncompressing $cmd_ver archive for $KERNEL${nc} :\n
fr_fr: # ${yel}Décompression de l'archive $cmd_ver pour $KERNEL${nc} :\n

source: # ${j}($m s)${end}${ge}${sf} - Restoring from nvidia.$res_version.tar.$zip_type${end}${end}
fr_fr: # ${j}($m s)${end}${ge}${sf} - Restauration depuis nvidia.$res_version.tar.$zip_type${end}${end}

source: # ($m sec.) - Restoring from nvidia.$res_version.tar.$zip_type
fr_fr: # ($m sec.) - Restauration depuis nvidia.$res_version.tar.$zip_type

source: # ${j}<b>Restoring $(old_version) libraries installation</b>${end}
fr_fr: # ${j}<b>Restauration des anciennes librairies $(old_version)</b>${end}

source: # ${v}${j}($n%)${end} - Patching $(dm_serv).service for driver load at session restart (experimental)${end}
fr_fr: # ${v}${j}($n%)${end} - Patche $(dm_serv).service pour l'activation des pilotes à la session (expérimental)${end}

source: # Patching $(dm_serv).service for driver load at session restart (experimental).
fr_fr: # Patche $(dm_serv).service pour l'activation des pilotes à la session (expérimental)

source: $(cat <<-MSG $warn_log_title ${v}Restart display manager service${end} (${y}experimental${end}) This is a experimental feature allowing drivers to be relaod at simple display manager restart. Potentialy usable : gdm, sddm, lightdm, lxdm. Unsable : kdm (lighdm only tested at this point). Be aware that system driver management will be complete only after system reboot. MSG )
fr_fr: $(cat <<-MSG $warn_log_title ${v}Redémarrage du service de gestion d'affichage${end} (${y}expérimental${end}) Ceci est une fonction expérimentale permettant de recharger les pilotes au redémarrage du gestionnaire d'affichage. Potentiellement utilisable : gdm, sddm, lightdm, lxdm. Inutilisable : kdm (lighdm uniquement testé pour le moment). Notez que la prise charge des pilotes par le système ne sera complétée qu'après le redémarrage de l'ordinateur. MSG )

source: No, I will reboot
fr_fr: Non, je redémarrerai

source: $(cat <<-MSG ${j}${bf}$drv_on switch${end}${end} ${v}You are going to switch from ${j}$drv_off${end} to ${j}$drv_on${end} Are you sure ?${end} MSG )
fr_fr: $(cat <<-MSG ${j}${bf}Permutation vers $drv_on${end}${end} ${v}Vous allez permuter ${j}$drv_off${end} vers ${j}$drv_on${end} Êtes-vous certain ?${end} MSG )

source: Yes, switch to $drv_on
fr_fr: Oui, permuter vers $drv_on

source: No, keep $drv_off
fr_fr: Non, conserver $drv_off

source: DRIVER SWITCH from DKMS ${j}$drv_off${end} to ${j}$drv_on${end} build
fr_fr: PERMUTATION DE PILOTE DEPUIS ${j}$drv_off${end} DKMS VERS ${j}$drv_on${end}

source: # ${v}Switching from ${y}$drv_off${end} to ${y}$drv_on.${end}${end}
fr_fr: # ${v}Permutation depuis ${y}$drv_off${end} vers ${y}$drv_on.${end}${end}

source: # ${v}Depmod ${j}$KERNEL${end} modules ...${end}
fr_fr: # ${v}Depmod sur modules ${j}$KERNEL${end} ...${end}

source: # ${v}License is $license${end}
fr_fr: # ${v}La licence est $license${end}

source: # ${r}ERROR!${end}${y}: License is steal $license, reversing all.${end}
fr_fr: # ${r}ERREUR!${end}${y}: La licence est toujours $license, inversion du processus.${end}

source: # ${v}Set ${y}$drv_on${end} kernel options.${end}
fr_fr: # ${v}Définit les options noyau de ${y}$drv_on${end}.${end}

source: # ${v}Unset ${y}$drv_off${end} kernel options.${end}
fr_fr: # ${v}Désactive les options noyau de ${y}$drv_off${end}.${end}

source: # ${v}Re-create ${j}$KERNEL${end} initramfs ...${end}
fr_fr: # ${v}Recréation de l'initramfs pour ${j}$KERNEL${end} ...${end}

source: # ${ge}${sf} * Exec $KERNEL modules iniramfs ($m sec.)${end}${end}
fr_fr: # ${ge}${sf} * Exécute initramfs sur modules $KERNEL ($m sec.)${end}${end}

source: # ${v}Exec ${j}$KERNEL${end} modules reload${end}
fr_fr: # ${v}Exécute le rechargement des modules ${j}$KERNEL${end}${end}

source: # ${v}Exec ${j}$KERNEL${end} modules initramfs update${end}
fr_fr: # ${v}Mise à jour de l'initramfs pour les modules ${j}$KERNEL${end}${end}

source: # ${v}Restore ${j}$KERNEL${end} modules selinux connection ...${end}
fr_fr: # ${v}Restauration de la connexion Selinux des modules ${j}$KERNEL${end}.${end}

source: # ${ge}${sf} * Exec $KERNEL modules reload ($m sec.)${end}${end}
fr_fr: # ${ge}${sf} * Exécute le rechargement des modules $KERNEL ($m sec.)${end}${end}

source: # ${v}Set ${y}$drv_on${end} DKMS AUTOINSTALL option to \"yes\".${end}
fr_fr: # ${v}Définit l'option DKMS AUTOINSTALL à \"yes\" pour ${y}$drv_on${end}.${end}

source: # ${v}Driver ${y}$drv_on${end} switch done.${end}
fr_fr: # ${v}Permutation du pilote ${y}$drv_on${end} achevée.${end}

source: ${j}${bf}$drv_on switch${end}${end}
fr_fr: ${j}${bf}Permutation de $drv_on${end}${end}

source: $(cat <<-MSG ${j}${bf}Open Driver removal${end}${end} ${v}You are going to remove open source driver from driver tree. Are you sure ?${end} MSG )
fr_fr: $(cat <<-MSG ${j}${bf}Suppresion de pilote Ouvert${end}${end} ${v}Vous allez supprimer les pilotes Ouverts de l’arborescence des pilotes. Êtes-vous certain ?${end} MSG )

source: Yes, remove
fr_fr: Oui, supprimer

source: No, preserve
fr_fr: Non, converver

source: Open Source Drivers deletion
fr_fr: Suppression des Pilotes en Open Source

source: # ${v}Remove ${j}open source${end} drivers from DKMS tree${end}
fr_fr: # ${v}Supprime les pilotes ${j}open source${end} de l'arborescence DKMS${end}

source: # ${v}Restoring ${y}default${end} Nvidia drivers.${end}
fr_fr: # ${v}Restaure les pilotes Nvidia par ${y}default${end}.${end}

source: # ${v}License is back to NVIDIA${end}
fr_fr: # ${v}La licence est à nouveau NVIDIA${end}

source: # ${r}ERROR!${end}${y}: License is still Dual MIT/GPL, abort.${end}
fr_fr: # ${r}ERREUR!${end}${y}: La licence est toujours en Dual MIT/GPL. Abandon.${end}

source: # ${v}Restore ${j}$KERNEL${end} modules connection ...${end}
fr_fr: # ${v}Restaure la connexion des modules ${j}$KERNEL${end} ...${end}

source: # ${v}Set Nvidia DKMS AUTOINSTALL option to \"yes\".${end}
fr_fr: # ${v}Définit l'option DKMS Nvidia AUTOINSTALL à \"yes\".${end}

source: # ${v}Unset ${y}$drv_off${end} kernel options (if any).${end}
fr_fr: # ${v}Désactive les options noyau ${y}$drv_off${end} (s'il y a lieu).${end}

source: # ${v}Set back Configuration file to NVIDIA only.${end}
fr_fr: # ${v}Réactive la configuration à NVIDIA seulement.${end}

source: # ${v}Reboot for change to take effect.${end}
fr_fr: # ${v}Redémarrer pour que le changement prenne effet.${end}

source: ${j}${bf}Nvidia Driver refresh.${end}${end}
fr_fr: ${j}${bf}Rafraîchissement du pilote Nvidia.${end}${end}

source: # GRUB conf options update.
fr_fr: # Mise à jour des options GRUB.

source: # ${fonts} * GRUB conf options update.${end}${end}
fr_fr: # ${fonts} * Mise à jour des options GRUB.${end}${end}

source: # GRUB conf already set.
fr_fr: # Configuration GRUB déjà définie.

source: # ${fonts} * GRUB conf already set.${end}${end}
fr_fr: # ${fonts} * Configuration GRUB déjà définie.${end}${end}

source: # Create GRUB conf for nouveau driver blacklisting and other options.
fr_fr: # Crée les définitions GRUB pour la quarantaine du pilote Nouveau.

source: # ${fonts} * Create GRUB conf for nouveau driver blacklisting and other options.${end}${end}
fr_fr: # ${fonts} * Crée les définitions GRUB pour la quarantaine du pilote Nouveau.${end}${end}

source: # Update modprobe nvidia-drm option for $drm_msg.
fr_fr: # Mise à jour de l'option modprobe nvidia-drm pour $drm_msg.

source: # ${fonts} * Update modprobe nvidia-drm option for $drm_msg.${end}${end}
fr_fr: # ${fonts} * Mise à jour de l'option modprobe nvidia-drm pour $drm_msg.${end}${end}

source: # Modprobe $drm_msg nvidia-drm option already set.
fr_fr: # Définition de l'option Modprobe $drm_msg nvidia-drm déjà faite.

source: # ${fonts} * Modprobe $drm_msg nvidia-drm option already set.${end}${end}
fr_fr: # ${fonts} * Définition de l'option Modprobe $drm_msg nvidia-drm déjà faite.${end}${end}

source: $(cat <<-TIPS If set, GPU renderer choice will be set to PRIME by default You can changed this set in : > Configuration and Tools > Edit Zenvidia config. TIPS )
fr_fr: $(cat <<-TIPS Si défini, le choix de rendu du GPU sera changé à PRIME par défaut Vous pouvez changer cet attribut dans : > Outils et Configuration > Éditer la configuration de Zenvidia. TIPS )

source: $(cat <<-TIPS If set, this window wont be displayed at the next installation or update and recorded sets applicable. You can changed this set in : > Configuration and Tools > Edit Zenvidia config. TIPS )
fr_fr: $(cat <<-TIPS Si défini, cette fenêtre ne sera plus affichée à la prochaine installation ou mis à jour et les pré-enregistrés appliqué. Vous pouvez changer cet attribut dans : > Outils et Configuration > Éditer la configuration de Zenvidia. TIPS )

source: $(cat <<-INFO ${j}<b>PRIME Display GPU configuration</b>${end} ${v}There a few usable method to use Nvidia GPU for applications or desktop.${end} ${y}<u>PRIME</u>${end} : use NVIDIA dGPU as a primary renderer with iGPU off. ${y}<u>PRIME render offload</u>${end} : use NVIDIA dGPU as renderer and iGPU as desktop default. ${y}<u>NONE</u>${end} : use iGPU only, don't use NVIIDA dGPU (this cancel previous config too). ${sf} ${v}Notes${end} : <b>PRIME Render</b> is applicable for all version since 390 serie. <b>PRIME Render Offload</b> is applicable from 435 serie and X version 1.20.7 <b>You're actually running the ${y}$xorg_version${end} Xorg version. ${j}Only applicables will be listed${end}</b>. ${j}Notice${end} : <b>run_offload</b> script will be created during proces. It contains default ENV variables for <b>PRIME render offload</b>. This, is necessary to run any applications with dGPU render and need to be insert in desktop file or command line as below : > <b>[YOUR_ENV_VAR] run_offload [application]</b> <b>Full documentation can be found in</b> : > ${j}Help and Documentation${end} > ${j}Documentation Manual${end} - Chapter 17. <i>Using the NVIDIA Driver with Optimus Laptops</i> - Chapter 34. <i>Offloading Graphics Display with RandR 1.4</i> - Chapter 35. <i>PRIME Render Offload</i> ${end} INFO )
fr_fr: $(cat <<-INFO ${j}<b>Configuration du GPU PRIME Display</b>${end} ${v}Il existe quelques méthodes pour l'utilisation du GPU Nvidia pour le bureau ou les applications.${end} ${y}<u>PRIME</u>${end} : le dGPU NVIDIA comme rendu primaire avec le iGPU éteint. ${y}<u>PRIME render offload</u>${end} : le dGPU NVIDIA pour le rendu d'application et iGPU pour le bureau. ${y}<u>NONE</u>${end} : le iGPU uniquement, aucun usage du dGPU NVIIDA (annule aussi les définitions précédentes). ${sf} ${v}Notes${end} : <b>PRIME Render</b> est applicable pour toute version depuis la série 390. <b>PRIME Render Offload</b> est applicable depuis la série 435 et la version X 1.20.7 <b>Vous exécutez actuellement la version Xorg ${y}$xorg_version${end}. ${j}Les définitions applicables seront listées${end}</b>. ${j}Information${end} : le script <b>run_offload</b> sera crée durant le processus. Il contient des variables ENV par défaut pour <b>PRIME render offload</b>. Ceci est nécessaire pour exécuter les applications avec le rendu dGPU et nécessite d'être inséré dans les fichiers desktop ou en ligne de commande comme ci-dessous : > <b>[YOUR_ENV_VAR] run_offload [application]</b> <b>La documentation complète se touve dans</b> : > ${j}Aide et Documentation${end} > ${j}Manuel et documentation${end} (en anglais) - Chapter 17. <i>Using the NVIDIA Driver with Optimus Laptops</i> - Chapter 34. <i>Offloading Graphics Display with RandR 1.4</i> - Chapter 35. <i>PRIME Render Offload</i> ${end} INFO )

source: Select the default NVIDIA dGPU behaviour
fr_fr: Sélectionner le comportement par défaut du dGPU NVIDIA

source: Select in the list.
fr_fr: Sélectionner dans la liste.

source: Set Prime instead of Offload by default
fr_fr: Définir Prime à la place de Offload par défaut

source: Set Optimus Render config auto
fr_fr: Définir automatiquement la configuration du rendu Optimus

source: Cleaning old ${j}$(old_lib_version)${end} source and DKMS tree
fr_fr: Nettoyyage de l'ancienne arborescence source et DKMS de ${j}$(old_version)${end}

source: # Cleaning $rep_clean $(old_lib_version) DKMS tree
fr_fr: # Nettoyage de $rep_clean $(old_version) DKMS

source: # Cleaning $rep_clean $(old_lib_version) source tree
fr_fr: # Nettoyage de $rep_clean $(old_version) SOURCE

source: # ${v}${j}($n%)${end} - ${mf}Post install routines${end}${end}
fr_fr: # ${v}${j}($n%)${end} - ${mf}Routines de Post installation${end}${end}

source: # ${v}${j}($n%)${end} - Create XORG config file for Nvidia device${end}
fr_fr: # ${v}${j}($n%)${end} - Création de la configuration XORG pour périphérique Nvidia${end}

source: # ${v}${j}($n%)${end} - libraries sub routines${end}
fr_fr: # ${v}${j}($n%)${end} - Sous routines des librairies${end}

source: # ${j}($n%)${end}${ge}${sf} * Linking $nv_root libs to system${end}${end}
fr_fr: # ${j}($n%)${end}${ge}${sf} * Liens des librairies $nv_root au système${end}${end}

source: \t\t\t\t${gB} libwfb\t${end}> ${y}link to system${end}.\n
fr_fr: \t\t\t\t${gB} libwfb\t${end}> ${y}lié au système${end}.\n

source: # ${j}($n%)${end}${ge}${sf} * Fixing broken libs and links if needed${end}${end}
fr_fr: # ${j}($n%)${end}${ge}${sf} * Réparation des librairies et liens brisés si besoin${end}${end}

source: cleaned ($lib_x)\n
fr_fr: nettoyée(s) ($lib_x)\n

source: \t\t\t\t${gB} lib fix\t${end}> ${y}${fixed_lib_log[@]}${end}.\n
fr_fr: \t\t\t\t${gB} réparées\t${end}> ${y}${fixed_lib_log[@]}${end}.\n

source: links updated $elf_x
fr_fr: liens mis à jour $elf_x

source: \t\t\t\t${gB} link fix\t${end}> ${y}${fixed_lib_log[@]}${end}.\n
fr_fr: \t\t\t\t${gB} liens fixés\t${end}> ${y}${fixed_lib_log[@]}${end}.\n

source: # ${j}($n%)${end}${ge}${sf} * Fixing user's nvidia profiles rc file${end}${end}
fr_fr: # ${j}($n%)${end}${ge}${sf} * Réparation du fichier utilisateur nvidia profiles rc${end}${end}

source: # ${j}($n%)${end}${ge}${sf} * Validating new libraries (ldconfig)${end}${end}
fr_fr: # ${j}($n%)${end}${ge}${sf} * Validation des nouvelles librairies (ldconfig)${end}${end}

source: # ${j}($n%)${end}${ge}${sf} * Creating udev rules for $(chk_family) serie${end}${end}
fr_fr: # ${j}($n%)${end}${ge}${sf} * Création des règles udev pour la série $(chk_family)${end}${end}

source: # ${v}${j}($n%)${end} - Blacklisting and other routines${end}
fr_fr: # ${v}${j}($n%)${end} - Liste noire et autres routines${end}
