Repository: wildtruc/zenvidia
Catalog: locale/locale_dev/*.po
Languages: fr_fr

source: Yes, restore and replace
fr_fr: Oui, restaurer et remplacer

source: ${v}Restore driver ${j}$res_version${end} and missing modules, if any.${end}
fr_fr: ${v}Restaure le pilote ${j}$res_version${end} et modules manquants, s'il y a lieu.${end}

source: # Restoring from nvidia.$res_version.tar$zip_ex...
fr_fr: # Restauration depuis nvidia.$res_version.tar$zip_ex...

source: # ($m sec.) - Rebuild modules dependencies (depmod)
fr_fr: # ($m sec.) - Reconstruction des dépendances modules (depmod)

source: # Rebuilding missing $res_version drivers for $KERNEL kernel..
fr_fr: # Reconstruction des modules $res_version manquants du noyau $KERNEL..

source: (restored)
fr_fr: (restauré)

source: # FAILURE : DKMS compilation ERROR !!
fr_fr: # ÉCHEC : ERREUR compilation DKMS !!

source: # FAILURE : See 'Update drivers or modules' > 'Update driver only (dkms/force)' to force build.
fr_fr: # ÉCHEC : Voir 'Mettre à jour les pilotes et modules' > 'Mettre à jour le pilote (dkms/forcé)' pour forcer.

source: # FAILURE : No source directory found for $res_version
fr_fr: # ÉCHEC : Pas de dossier source trouvé pour $res_version

source: # ($m sec.) - Rebuilding INITRAMFS
fr_fr: # ($m sec.) - Reconstruction de l'INITRAMFS

source: # Clear : $res_version modules checked in $KERNEL kernel.
fr_fr: # Propre : modules $res_version vérifiés pour le noyau $KERNEL.

source: # Restore $res_version modules system symlinks.
fr_fr: # Restaure les liens symboliques des modules $res_version.

source: ${v}\nDefine options and functions you would like to use or change\n${end}
fr_fr: ${v}\nDéfinir les options et fonctions que vous désirez utiliser ou changer\n${end}

source: ${j}${bf}Zenvidia Configuration${end}$help_tip${end}
fr_fr: ${j}${bf}Configuration de Zenvidia${end}$help_tip${end}

source: Reconfigure grub and/or modules options sets
fr_fr: Reconfigurer Grub et/ou les options modules

source: Yes, apply
fr_fr: Oui, appliquer

source: No, I'll apply later
fr_fr: Non, j'appliquerai plus tard

source: $(cat <<-WRN ${jB}Open Driver Switch${end} ${v}<b>Open driver settings have been change</b>. Do you want to apply now ?${end} WRN )
fr_fr: $(cat <<-WRN ${jB}Permutation Pilote Ouvert${end} ${v}<b>La définition du pilote Ouvert changé</b>. Voulez-vous appliquer maintenant ?${end} WRN )

source: $(cat <<-WRN ${jB}Driver Switch${end} ${v}<b>Open driver settings have been change.</b> ${j}You don't have superuser privileges${end}. Please launch ${y}Open Driver switch${end} task bar menu entry to apply.${end} WRN )
fr_fr: $(cat <<-WRN ${jB}Permutation Pilote${end} ${v}<b>La définition du pilote Ouvert changé.</b> ${j}Vous n'avez pas les privilèges superutilisateur${end}. SVP, lancer ${y}Permutation Pilote Ouvert${end} depuis le menu de la barre des tâches pour appliquer.${end} WRN )

source: $(cat <<-SPL DISPLAY PREVIEW : ${rBB}TITLE${end} ${j}${bf}Sub TTILE${end}${end} TEXT, comment and sub comment : Main is desktop default text color ${v}Once upon a time in south west ? I don't care !${end}. ${y}But I can alternate between East and West, but I still don't care ...${end} LOGS : ${vB}Command cleared${end} ${gB}passed${end} > ${y}log message values.${end} ${vB}Command issue warning${end} ${jB}warning${end} > ${y}log message values.${end} ${vB}Command non fatal error${end} ${rB}error${end} > ${y}log message values.${end} SPL )
fr_fr: $(cat <<-SPL APEERÇU D'AFFICHAGE : ${rBB}TITRE${end} ${j}${bf}Sous TITRE${end}${end} TEXTE, commentaire et sous commentaire : Couleur par défaut des textes ${v}Était-il une fois dans le Sud-Ouest ? Je m'en moque !${end}. ${y}Mais je peux alterner entre l'Est et l'Ouest, mais je m'en moque encore ...${end} LOGS : ${vB}Commande achevée${end} ${gB}passé${end} > ${y}valeur du message.${end} ${vB}Commande avertissement${end} ${jB}attention${end} > ${y}valeur du message.${end} ${vB}Commande non erreur fatale ${end} ${rB}erreur${end} > ${y}valeur du message.${end} SPL )

source: $(cat <<-TXT ${j}${bf}Basic font colors and style${end}${end} ${v}Change GUI font colors to fit your desktop theme.${end} TXT )
fr_fr: $(cat <<-TXT ${j}${bf}Couleur des polices et style des polices de base${end}${end} ${v}Change la couleur des polices GUI pour correspondre au thème.${end} TXT )

source: $(cat <<-SPL ${rBB}TITLE${end}\t${j}${bf}Sub TTILE${end}${end} ${v}main text${end} ${y}Log messages${end} ${gB}Log cleared${end} ${jB}Log warnings${end} ${rB}Log Errors${end} SPL )
fr_fr: $(cat <<-SPL ${rBB}TITRE${end}\t${j}${bf}Sous TITRE${end}${end} ${v}texte principal des ${end}${y}journaux${end} ${gB}journal achevé${end} ${jB}alertes journal${end} ${rB}Erreur journal${end} SPL )

source: $(cat <<-TIP ${j}* NOTICE *${end} ${sf}Colors will apply immediatly after validation. Do not forget Xterm only support a limited type of colors. ${y}Xterm colors are also applied to Yad's text windows.${end}${end} TIP )
fr_fr: $(cat <<-TIP ${j}* INFORMATION *${end} ${sf}Les couleurs seront appliquées immédiatement après validation. N'oubliez pas que Xterm ne supporte qu'un nombre limité de couleurs. ${y}Les couleurs Xterm sont aussi utilisées dans la fenêtre texte de Yad.${end}${end} TIP )

source: Title and warning messages font color
fr_fr: Couleur des titres et messages d'alerte

source: Sub window title font color
fr_fr: Couleur des sous-titres

source: Comment font color\t\t
fr_fr: Couleur des commentaires

source: Sub comment font color\t\t
fr_fr: Couleur des sous-commentaires

source: Log clear font color\t\t
fr_fr: Couleur des log validés\t\t

source: Log warning font color\t\t
fr_fr: Couleur des avertissements\t\t

source: Log error font color\t\t
fr_fr: Couleur des erreurs\t\t

source: Sub Titles font type
fr_fr: Police des sous-titres

source: Normal font type
fr_fr: Police normale

source: Xterm and log forground color
fr_fr: Couleur d'avant-plan Xterm

source: Xterm and log background color
fr_fr: Couleur d'arrière-plan Xterm

source: Preview
fr_fr: Prévisualisation

source: Reload with newly setted values
fr_fr: Recharger les nouvelles définitions

source: Done
fr_fr: Fait

source: ${r}<small>$DEV TIP not found, undocumented or obsolete option.</small>${end}
fr_fr: ${r}<small>$DEV TIP non trouvé, option obsolète ou non documentée.</small>${end}

source: $(cat <<-TIP ${r}<small>$DEV TIP not found, undocumented or obsolete option.</small>${end} TIP )
fr_fr: $(cat <<-TIP ${r}<small>$DEV TIP non trouvé, option obsolète ou non documentée.</small>${end} TIP )

source: $(cat <<-DEVICE ${j}${bf}Graphic Display Configuration${end}${end} <i>From Xorg configuration file ($xorg_cfg)</i> ${sf} <b>Full documentation can be found in</b> : > ${j}Help and Documentation${end} > ${j}Documentation Manual${end} - Appendice B. <i>X Config Options</i> ${end} Device(s) detected : ${y}${dev_name[*]}${end} DEVICE )
fr_fr: $(cat <<-DEVICE ${j}${bf}Configuration de l'interface graphique${end}${end} <i>Depuis le fichier de configuration Xorg ($xorg_cfg)</i> ${sf} <b>La documentation complète peut être trouvé dans</b> : > ${j}Aide et Documentation${end} > ${j}Manuel de documentation${end} - Appendice B. <i>X Config Options</i> ${end} Appareil(s) détecté(s) : ${y}${dev_name[*]}${end} DEVICE )

source: Xorg Server
fr_fr: Serveur Xorg

source: $(cat <<-HLP ${sf} - <b>Edit full Xorg (GUI)</b> Edit all non sensitives Xorg option and sets in tabed GUI. - <b>Edit full Xorg (text)</b> Edit Xorg configuration file in a text editor. - <b>Execute Xorg auto config</b> Re-create Zenvidia Xorg configuration file creation automation. ${end} HLP )
fr_fr: $(cat <<-HLP ${sf} - <b>Éditer intégralement Xorg (GUI)</b> Éditer toutes les options non sensible dans GUI avec onglet. - <b>Éditer intégralement Xorg (texte)</b> Éditer la configuration Xorg dans un éditeur de texte. - <b>Exécuter l'auto configuration Xorg</b> Re-créer le fichier de configuration Xorg (Zenvidia automation). ${end} HLP )

source: $(cat <<-WARN ${j}<b>Xorg config file missing</b>${end} No xorg configuration file found. There is nothing to edit. WARN )
fr_fr: $(cat <<-WARN ${j}<b>Fichier Xorg manquant</b>${end} Aucun fichier de configuration xorg trouvé. Il n'y a rien à éditer. WARN )

source: Edit full Xorg (GUI)
fr_fr: Éditer intégralement Xorg (GUI)

source: Edit full Xorg (text)
fr_fr: Éditer intégralement Xorg (texte)

source: Execute Xorg auto config
fr_fr: Exécuter l'auto configuration Xorg

source: ${j}${bf}Edit Xorg Config File${end}${end}\nEdit or manage Xorg config and options.\n$hlp_tip
fr_fr: ${j}${bf}Éditer la configuration Xorg${end}${end}\nÉditer ou gérer les options Xorg.\n$hlp_tip

source: $(cat <<-WRN ${j}<b>You are going to modify $(distro_version) configuration file</b>${end} Variables and datas from this file are very sensitives and could potentialy breaks Zenvidia. ${r}<i>Are you sure about what you are doing ?</i>${end} WRN )
fr_fr: $(cat <<-WRN ${j}<b>Vous allez modifier le fichier de configuration de $(distro_version)</b>${end} Les variables et données de ce fichier sont sensibles et peuvent potentiellement briser Zenvidia. ${r}<i>Êtes-vous certain de ce que vous faites ?</i>${end} WRN )

source: I live dangerously
fr_fr: Je vis dangereusement

source: Well, I'm finally a coward
fr_fr: Hé bien je suis finalement un lâche

source: ${j}<b>$(distro_version) configuration file</b>${end}
fr_fr: ${j}<b>Configuration du fichier $(distro_version)</b>${end}

source: Abort (panic button)
fr_fr: Abandon (panic button)

source: ${j}<b>Zenvidia help text</b>${end}
fr_fr: ${j}<b>Test d'aide Zenvidia</b>${end}

source: $(cat <<-ABOUT ${v}${j}${bf}About Zenvidia${end}${end} Version : ${y}$(cat $(user_CF_DIR)/zen_version)${end} License : ${y}LGPLv3${end} Author : ${y}@PirateProd - 2020-2023${end} website : ${y}$zenvidia_git${end} contact : ${y}wildtruc@noneltd.net${end} ${end} ABOUT )
fr_fr: $(cat <<-ABOUT ${v}${j}${bf}À Propos de Zenvidia${end}${end} Version : ${y}$(cat $(user_CF_DIR)/zen_version)${end} Licence : ${y}LGPLv3${end} Auteur : ${y}@PirateProd - 2020-2023${end} site web : ${y}$zenvidia_git${end} contact : ${y}wildtruc@noneltd.net${end} ${end} ABOUT )

source: ${j}${bf}Zenvidia Change Logs list${end}${end}
fr_fr: ${j}${bf}Liste des journaux Zenvidia${end}${end}

source: ${j}${bf}Nvidia Documentation ${end}$help_tip${end}
fr_fr: ${j}${bf}Documentation Nvidia${end}$help_tip${end}

source: ${j}Nvidia $(version) Documentation - ${y}$chap_start${end}${end}
fr_fr: ${j}Documentation Nvidia $(version) - ${y}$chap_start${end}${end}

source: \n\nNothing to display here.\n\nLog file empty.
fr_fr: \n\nRien à afficher.\n\nFichier de Log vide.

source: ${bf}${j}Changelog : ${y}$entrylog${end}${end}${end}
fr_fr: ${bf}${j}Journal des changements : ${y}$entrylog${end}${end}${end}

source: ${j}${bf}Nvidia Change Logs list $relist_title${end}${end}
fr_fr: ${j}${bf}Liste des journaux Nvidia $relist_title${end}${end}

source: Zenvidia changelog ( $log_verion ) :\n\nNothing to display here.\nLog file empty.
fr_fr: Journal Zenvidia ( $log_verion ) :\n\nRien à afficher ici.\nfichier de log vide.

source: ${v}<b>Zenvidia changelog : ${y}$log_version${end}</b>${end}
fr_fr: ${v}<b>Journal Zenvidia : ${y}$log_version${end}</b>${end}

source: ${vB}Autostart launcher will be set to :\n<b>></b>${end} ${j}$_notif${end}
fr_fr: ${vB}Le lanceur d'auto-exécution sera définit à :\n<b>></b>${end} ${j}$_notif${end}

source: Check driver update only;driver check only;n
fr_fr: Contrôle des mises à jour pilote uniquement;contrôle pilote uniquement;n

source: Check zenvidia and driver update;driver and zenvidia check;z
fr_fr: Contrôle des mises à jour pilote et de zenvidia;contrôle pilote et zenvidia;z

source: $(cat <<-HLP <i>You can leave it as it is or choose between one of the sets below</i>. HLP )
fr_fr: $(cat <<-HLP <i>Vous pouvez laisser tel quel ou choisir entre l'une des définitions suivantes</i>. HLP )

source: $(cat <<-MSG ${j}${bf}Notifications config${end}${end} Notification is currently set to: ${y}$c_set_cnf${end} MSG )
fr_fr: $(cat <<-MSG ${j}${bf}Configuration des notifications${end}${end} La notification est actuellement définie à: ${y}$c_set_cnf${end} MSG )

source: driver check only
fr_fr: contrôle du pilote uniquement

source: driver and zenvidia check
fr_fr: contrôle du pilote et de Zenvidia

source: $(cat <<-HLP ${v}Select here the install type${end} ${sf} - <b>From a local package</b>: Install a new driver from a user directory local package or a listed already downloaded with zenvidia. - <b>From Nvidia server</b>: Will display the full drivers list from the Nvidia server. Install and download will be executed in the next step. ${end} HLP )
fr_fr: $(cat <<-HLP ${v}Sélectionner ici le type d'isntallation${end} ${sf} - <b>Depuis un paquet local</b>: Installer un nouveau pilote depuis un dossier utilisateur local ou déjà téléchargés avec Zenvidia. - <b>Depuis le serveur NVIDIA</b>: Affichera la liste complète des pilotes depuis le serveur Nvidia. L'installation et le téléchargement s’exécuteront aux étapes suivantes. ${end} HLP )

source: \n${v}Select here the install type${end}
fr_fr: \n${v}Sélectionner le type d'installation${end}

source: From a local package
fr_fr: Depuis un paquet local

source: From NVIDIA server
fr_fr: Depuis le serveur NVIDIA

source: ${j}${bf}Install new drivers${end}\n${end}$hlp_tip
fr_fr: ${j}${bf}Installation de nouveaux pilotes${end}\n${end}$hlp_tip

source: ${vB}NVIDIA package update from local dir. ${end}
fr_fr: ${vB}Mise à jour depuis un paquet du répertoire NVIDIA local. ${end}

source: ${vB}NVIDIA package update from NVIDIA server.${end}
fr_fr: ${vB}Mise à jour depuis le serveur NVIDIA.${end}

source: $(cat <<-HLP ${v}Select here the element to update or install${end} ${sf} - <b>Driver upgrade</b> Check for new driver update. You can select during the process to download only or install directly. If <i>download only</i> is chosen, for installation afterward go back to : » ${j}main${end} menu » ${j}Install Drivers${end} <u>Note</u> : All download are stored. - <b>Update driver only (dkms)</b> Install nvidia dkms modules for a new running kernel. - <b>Update driver only (force)</b> Optional command to force install from driver sources in case of DKMS failure. - <b>Update driver for an other kernel (dkms)</b> Optional command to update nvidia modules for an other kernel. ${end} HLP )
fr_fr: $(cat <<-HLP ${v}Sélectionner ici l'élément à mettre à jour ou installer${end} ${sf} - <b>Mise à niveau du pilote</b> Vérifie les mise à jour pilote. Vous pouvez choisir durant le processus de télécharger ou d'installer directement. Si <i>télécharger uniquement</i> est choisi, pour installer après coup retourner à : » Menu ${j}principal${end} » ${j}Installer des pilotes${end} <u>Note</u> : Tous les téléchargements sont stocké. - <b>Mettre à jour le pilote uniquement (dkms)</b> Installe des modules dkms nvidia pour un nouveau noyau. - <b>Mettre à jour le pilote uniquement (forcé)</b> Commende optionnelle pour forcer l'installation depuis les source pilotes dans le cas d'un échec de DKMS. - <b>Mettre à jour le pilote pour un autre noyau (dkms)</b> Commande optionnelle pour mettre à jour les modules nvidia pour un autre noyau. ${end} HLP )

source: \n${v}Select here the element to update or install${end}
fr_fr: \n${v}Sélectionner ici l'élément à installer ou mettre à jour${end}

source: Driver upgrade
fr_fr: Mise à niveau du pilote

source: Update driver only (dkms)
fr_fr: Mettre à jour le pilote uniquement (dkms)

source: Update driver only (force)
fr_fr: Mettre à jour le pilote uniquement (forcé)

source: Update driver for an other kernel (dkms)
fr_fr: Mettre à jour le pilote pour un autre noyau (dkms)

source: Update driver only
fr_fr: Mettre à jour le pilote uniquement

source: Update driver for an other kernel
fr_fr: Mettre à jour le pilote pour un autre noyau

source: ${j}${bf}Update Drivers or kernel modules${end}${end}$hlp_tip
fr_fr: ${j}${bf}Mise à jour les pilotes ou les modules noyau${end}${end}$hlp_tip

source: ${v}Check driver updates list${end}
fr_fr: ${v}Contrôle de la liste des mises à jour${end}

source: ${v}Build module for current kernel (dkms)${end}
fr_fr: ${v}Construction des modules pour le noyau courant (dkms)${end}

source: ${v}Build module for current kernel (force)${end}
fr_fr: ${v}Construction des modules pour le noyau courant (force)${end}

source: ${v}Build module for the selected kernel (dkms)${end}
fr_fr: ${v}Construction des modules pour le noyau sélectionné (dkms)${end}

source: $(cat <<-HLP ${v}Select here the element to modify or edit:${end} ${sf} - <b>Edit Xorg config file</b>: Edit the current xorg configuration file in /etc/X11. - <b>Edit script config</b>: Edit Zenvidia basic user conf script to set or unset mostly everything. - <b>Edit GUI font colors</b>: Change defaults font colors. - <b>Nvidia settings</b>: Start Nvidia-setting graphic UI tool. - <b>Edit distro config</b>: Modify the distribution configation file. <u>Notice</u> : You can add here the very specifics distro's variables. - <b>Manage drivers packages</b>: This tool is to backup, restore and remove old or current driver install. It also manage dowloaded nvidia's .run pack. <u>Note</u> : if old installation is found during driver update, it is automatically backed up prior to new version installation. - <b>Notication settings</b>: Configuration tool for Zen_notify daily update checker. - <b>Open driver switch tool</b> (optional): When available, this tool allow to switch between open and proprietary source drivers. - <b>Prime Display Tool</b> (optional) When available, manage Prime Display behaviour. PRIME and PRIME render offload managed only. ${end} HLP )
fr_fr: $(cat <<-HLP ${v}Sélectionner ici l’élément à éditer ou modifier${end} ${sf} - <b>Éditer le fichier de configuration Xorg</b>: Éditer le fichier de configuration courant xorg dans /etc/X11. - <b>Éditer la configuration de Zenvidia</b>: Éditer le fichier configuration de base de Zenvidia basique et toutes ses options. - <b>Éditer les couleurs du GUI</b>: Changer les couleurs par défaut des polices. - <b>Nvidia settings</b>: Démarrer l'outil graphique Nvidia-setting. - <b>Éditer la configuration de la distribution</b>: Modifier le fichier de configuration de la distribution locale. <u>Information</u> : Vous pouvez ajouter ici les variables spéciales de la distribution. - <b>Gérer les paquets de pilotes</b>: Cet outil permet de sauvegarder, restaurer ou supprimer des pilotes anciens ou courants. Ou gérer aussi les paquets Nvidia .run téléchargés. <u>Note</u> : si trouvé pendant la mise à jour du pilote, il est automatiquement sauvegardé avant l'installation d'une nouvelle version. - <b>Configuration des notifications Zenvidia</b>: Outil de configuration pour le contrôle journalier de Zen_notify. - <b>Outil de permutation du pilote Ouvert</b> (optionnel): Quand disponible, cet outil permet de basculer entre les sources de pilotes Ouvert et Propriétaire. - <b>Outil Prime Display</b> (optionel) Quand disponible, gére le comportement du Prime Display. Pris en charge de PRIME et PRIME render offload uniquement. ${end} HLP )

source: \n${v}Select here the element to modify or edit${end}
fr_fr: \n${v}Sélectionner ici l’élément à éditer ou modifier${end}

source: Edit xorg config file
fr_fr: Éditer le fichier de configuration Xorg

source: Edit Zenvidia config
fr_fr: Éditer la configuration de Zenvidia

source: Edit GUI Colors
fr_fr: Éditer les couleurs du GUI

source: Edit Distro config
fr_fr: Éditer la configuration de la distribution

source: Manage drivers packages
fr_fr: Gérer les paquets de pilotes

source: Zenvidia notification config
fr_fr: Configuration des notifications Zenvidia

source: Open driver switch tool
fr_fr: Outil de permutation du pilote Ouvert

source: PRIME Display config
fr_fr: Configuration PRIME Display

source: ${j}${bf}Configuration and Tools${end}${end}$hlp_tip
fr_fr: ${j}${bf}Outils et Configuration${end}${end}$hlp_tip

source: $(cat <<-TIP ${v}README and Help file from Nvidia $(version) and other.${end} ${sf} - <b>Documanetation</b>: Read the current Nvidia help file. - <b>Change Logs</b>: Read the current Nvidia changelog file. - <b>Zenvidia Logs</b>: Read the Zenvidia changelog file. - <b>Zenvidia Help</b>: Read Zenvidia doc file. - <b>About Zenvidia</b>: Read current Zenvidia README file. ${end} TIP )
fr_fr: $(cat <<-TIP ${v}README et fichier d'aide depuis Nvidia $(version) et autres.${end} ${sf} - <b>Documentation</b>: Lire la documentation actuelle Nvidia - <b>Change Logs</b>: Lire Le fichier changelog actuel Nvidia. - <b>Zenvidia Logs</b>: Lire le fichier changelog Zenvidia. - <b>Aide Zenvidia</b>: Lire la documentation Zenvidia. - <b>À propos de Zenvidia</b>: Lire le fichier \"À PROPOS\" de Zenvidia. ${end} TIP )

source: \n${v}README and Help file from Nvidia $(version) and other.${end}
fr_fr: \n${v}README et fichier d'aide Nvidia $(version) et autres.${end}

source: Documention manual ($(version))
fr_fr: Manuel et documentation ($(version))

source: Change Logs ($(version))
fr_fr: Journal des modifications ($(version))

source: Zenvidia Logs
fr_fr: Journal des modifications Zenvidia

source: Zenvidia Help
fr_fr: Aide Zenvidia

source: About Zenvidia
fr_fr: À propos de Zenvidia

source: ${j}${bf}Help and Documentation${end}${end}
fr_fr: ${j}${bf}Aide et Documentation${end}${end}

source: $(cat <<-WRN ${y}${bf}Your are not superuser${end}${end} This command can't be executed without ${j}<b>administrator</b>${end} privilege. See ${j}<b>Zenvidia task bar</b>${end} to run as admin or ${j}<i>Zenvidia (administrator)</i> desktop entry${end} instead. WRN )
fr_fr: $(cat <<-WRN ${y}${bf}Vous n'êtes pas superutilisateur${end}${end} Cette commande ne peut être exécutée sans le privilège ${j}<b>Administrateur</b>${end} Voir la ${j}<b>barre des tâches Zenvidia</b>${end} pour exécuter en tant qu'admin ou l'entée de bureau ${j}<i>Zenvidia (administrateur)</i>${end} à la place. WRN )

source: ${vB}Card $((${dev_n[$e]}+1)) :${end}${ge} ${end}${j}${dev[$e]} ($(echo ${vnd[$e]} | awk '{print $1}'))${end}
fr_fr: ${vB}Carte $((${dev_n[$e]}+1)) :${end}${ge} ${end}${j}${dev[$e]} ($(echo ${vnd[$e]} | awk '{print $1}'))${end}

source: and in use
fr_fr: et en usage

source: , but unused
fr_fr: , mais non utilisé

source: , closed source used
fr_fr: , propriétaire utilisé

source: ${vB}Open Source modules :${end}${ge} ${end}${j}installed$open_used${end}
fr_fr: ${vB}Modules Open Source :${end}${ge} ${end}${j}installé$open_used${end}

source: ${vB}Modules license :${end}${ge} ${end}${j}$(modinfo -F license nvidia)\n${end}
fr_fr: ${vB}Licence des modules :${end}${ge} ${end}${j}$(modinfo -F license nvidia)\n${end}

source: $USER\n(system write privilege not allowed)$scan_alert
fr_fr: $USER\n(Privilège en écriture non autorisé)$scan_alert

source: $(cat <<-HLP ${v}Help tips text is currently set${end} ${sf}You can unset it at any moment in: ${j}Configuration and Tools${end} menu » ${j}Edit script config${end}. ${end} HLP )
fr_fr: $(cat <<-HLP ${v}Les Tips d'aide sont actuellement activés${end} ${sf}Vous pouvez les désactiver à tout moment avec : Menu ${j}Outils et Configurations${end} » ${j}Éditer la configuration du script${end}. ${end} HLP )
